{"campaigns":[{"source":"gfm","image":"https://images.gofundme.com/P9sLhtsAEZuuZTp3U1f7sc2VNic=/640x480/https://d2g8igdw686xgo.cloudfront.net/48434572_1590947589313403_r.jpg","hearts":79,"launched":"2020-05-31T13:02:20-05:00","current":3935,"deactivated":false,"donations":80,"donations_enabled":true,"goal":5000,"name":"Rebuilding After The Riots, Giving Back To Rae Ann","id":"20t6qmq8tc","longDesc":"Anyone who knows Rae Ann and family knows they are the most giving and generous people out there. Their livelihood was victimized by the riots and looting from last night.  Without getting into many details, insurance is very “fickle” with certain circumstances.  Rae Ann was the Co-Founder of a group called Helping Essential Workers and played a MAJOR role is feeding close to 7000 local essential workers along with raising the $15000 used to feed these essentials.  Not only did she play a major roll but her stores donated HUNDREDS of dollars to feed the cause!  Now is our turn to give back and support the “supporter”.  There are clean up costs along with rebuild and restock costs, and everything in between! Please consider donating to an amazing family and upstanding business that supports our community in so many ways.","desc":"Anyone who knows Rae Ann and family knows they are the most giving a","region":"NY","shared_count":455,"campaign_state":"active","user":"Nadene Madigan","index":0},{"source":"gfm","image":"https://images.gofundme.com/gG9MqkJSW4cK-qiokcO-CtKAy_I=/640x480/https://d2g8igdw686xgo.cloudfront.net/48426462_1590910107826101_r.jpeg","hearts":1207,"launched":"2020-05-31T02:30:36-05:00","current":56964,"deactivated":false,"donations":1263,"donations_enabled":true,"goal":100000,"name":"Bay Area Black Owned Business Relief Fund","id":"bay-area-black-owned-business-relief-fund","longDesc":"\nHello, my name is Ashley and I’m from Oakland. I’m working with Monica, Tim, Samatha, Erika and Steve to raise money for Black Owned Businesses around the Bay Area.\n\n\nThis fundraiser is for Bay Area Owned Black Business Owners affected by the protests, riots, and looting. You must be a verified Bay Area Black Business owner to receive support. Please donate whatever you can donate! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We begin supporting and rebuilding our community by helping one another during these times. Our goal is to support Bay Area, however other cities are in consideration so if you know any businesses in other cities please let us know and donate! Thank you.\n\n\nOur plan is to disperse the money earned to 10 business owners chosen by the people of our community. Please feel free to leave a comment of a business you know of that’s in need and we will continue to post updates. To ensure that these businesses receive all the funds that’s intended for them, we will post who received the donations along with their website or social media account. Thank you again. \n","desc":"\nHello, my name is Ashley and I’m from Oakland. I’m working with Monica, Tim","region":"CA","shared_count":496,"campaign_state":"active","user":"BAY AREA RELIEF","index":1},{"source":"gfm","image":"https://images.gofundme.com/Bx-8JqKoIvtY4tYr4mMt5hDY4Ug=/640x480/https://d2g8igdw686xgo.cloudfront.net/48444598_1591035841586442_r.jpeg","hearts":59,"launched":"2020-05-31T21:19:53-05:00","current":2360,"deactivated":false,"donations":61,"donations_enabled":true,"goal":10000,"name":"Corbo's Bakery Cleveland Riot Damage Fund","id":"corbo039s-bakery-cleveland-riot-damage","longDesc":"Corbo's was founded by Joe Corbo's grandparents in 1958 on Kinsman and was moved to Mayfield Road in Little Italy in the early 1960s.  Corbo's is truly a family business, as its roster of 40 workers includes 10 members of the Corbo family.As immigrant Italians that started out with nothing, they built their foundation in Little Italy, Cleveland and have become a staple in our community.  On May 31, 2020 violent riots broke out in Cleveland after a peaceful protest mourning the loss of George Floyd.  As a nation, we are all devastated by his tragedy and we pray for peace and comfort of his family.Instead of coming together as a nation in solidarity, people started rioting, vandalizing, and looting stores.  Corbo's Bakery Playhouse Square was in the line of fire and after standing out all day trying to protect their business, people were throwing things at the owners and their family, and after getting hit in the head with red bull cans among other things, they went inside to protect their lives rather than their windows.  They exercised their 2nd Amendment right of the Constitution of the United States to protect their personal property which, if damaged, could have affected the livelihood of the business they worked so hard at since 1958.  Corbo's was set to reopen on June 1st, 2020 after the state wide shutdown from Covid-19. During the riots, their largest window was vandalized and smashed out.  Their opening is now delayed causing loss of income and wages and their window needs to be repaired.After the video aired, they have received threats and have been overwhelmed with negative feedback, but the positive support and feedback has outweighed that so we want to continue to support their family and business in the community.As a humble family, they did not start a fund for repairs so as a local business owner, I wanted to step in and raise money for them.  The beneficiary is confirmed and going to the owners, Selena and Joe Corbo, on behalf of Corbo's Bakery Playhouse and they thank you for your gratitude and support as they rebuild and reopen.A general estimate for the window was about $7000 to replace and riots are not covered by insurance.God bless you all and thank you for coming together to rebuild the community and help the family!","desc":"Corbo's was founded by Joe Corbo's grandparents in 1958 on Kinsman and was mov","region":"OH","shared_count":1719,"campaign_state":"active","user":"Catherine Ann","index":2},{"source":"gfm","image":"https://images.gofundme.com/tpPB3tieEmzt1-dHA0W4l4FRAOI=/640x480/https://d2g8igdw686xgo.cloudfront.net/48379414_1590714964196284_r.jpeg","hearts":888,"launched":"2020-05-28T20:30:42-05:00","current":43180,"deactivated":false,"donations":890,"donations_enabled":true,"goal":50000,"name":"Demolished Small Business in Minneapolis Riot","id":"demolished-small-business-in-minneapolis-riot","longDesc":"Imagine leaving your life of 50 years behind to move to a country for its freedom and opportunity to make a better life, then overnight, you lose everything. A business you built with the little savings that you had, and out of nowhere, everything is shattered with no one to help.These lovely human beings are my parents. They left everything behind to make a better life for their children (me and my brothers). Their small used car shop was destroyed on May 27th, 2020, in the Minneapolis riot that took place for George Floyd. A man who was brutally murdered by the Police, an act of injustice and racism.I'm asking you for half of what is needed to help rebuild my parents' business back up. Everything helps. Please consider donating, even if it's $1, and share with your social group. I will be uploading a video explaining everything that has happened. And I will provide updates weekly.13 cars were stolen from the shop, and everything that's been left behind has been severely damaged. Windows broken into, all car key stolen, the tiny office in the corner of the lot has been turned upside down, and according to the lawyers we spoke to, there is no legal action that can be taken since there were thousands of people involved.The shop had just been rebuilt and completed this month, recovering from an electrical fire that set the entire lot and building on fire, destroying everything. Sadly, they did not have any insurance since their building was not finished completely which would prevent insurance agents from being able to assess the property value.","desc":"Imagine leaving your life of 50 years behind to move to a country for","region":"MN","shared_count":1808,"campaign_state":"active","user":"Kianmehr Ehtiatkar","index":3},{"source":"gfm","image":"https://images.gofundme.com/DByhsyWEdV_vb8NbNZT2E_i-Bug=/640x480/https://d2g8igdw686xgo.cloudfront.net/48454474_159104563120260_r.jpg","hearts":95,"launched":"2020-06-01T09:39:26-05:00","current":2586,"deactivated":false,"donations":100,"donations_enabled":true,"goal":200000,"name":"EXPRESS FOOD MARKET RELIEF","id":"express-food-market-relief","longDesc":"My father needed one more year to pay off for this store and now it is all totaled. All merchandise was stolen, the lottery machine was stolen and all the money in the register was stolen. The looters also made a hole in the wall to get to the back of the store to find even more merchandise. There is an estimated 400k loss. We are completely devastated because this store was our only source of income.I am asking that people donate what they can to help my family get back on our feet. Anything is much appreciated. We need to protect and support small businesses owned by people of color. If you have any questions, you can text me at (312) 792-4360Thank you.","desc":"My father needed one more year to pay off for this store and now it is all totaled. All merc","region":"IL","shared_count":134,"campaign_state":"active","user":"Asalh S Ghasim","index":4},{"source":"gfm","image":"https://images.gofundme.com/1-BcMRRCCrw3nqtO8t7aEMECwu8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48395280_1590787495875169_r.jpeg","hearts":280,"launched":"2020-05-29T16:07:51-05:00","current":12173,"deactivated":false,"donations":279,"donations_enabled":true,"goal":20000,"name":"Family Owned Business Affected by Riots and Covid","id":"family-owned-business-effected-by-riots-and-covid","longDesc":"Emily's Eatery was vandalized, glass smashed, looted/robbed. This family has felt the impact from covid-19 and lost their catering events that are the core of their business including graduations, weddings, funerals, etc.  Their little family restaurant and neighborhood hidden gem, Emily's Eatery, formerly Emily's F &amp; M Cafe  that was owned by her beautiful Aunt Emily and Uncle Elliott, is what was keeping their catering company, and business, afloat. They have a $3000 deductible and are losing an average/roughly $2500 a day not being open. They had jobs for their staff, they have been feeding the shut ins and elderly when the Pandemic and Lockdown happened and they have just made plans to donate meals to front-line workers next week.  And knowing the family, they will most likely find a way to still do it.  This family is ALWAYS THE FIRST FAMILY, TO GIVE TO A CAUSE! They have lost out on 10s of thousands of dollars in business due to Covid-19. And now the Riots affecting Emily's. Let's show love and support, to this beautiful family who hires and employs wonderful people. And get Emily's back up and running ASAP.  THEY ALWAYS DO PAY IT FORWARD AND HELP THE COMMUNITY. Let's help to pay something back. Support small local family business.","desc":"Emily's Eatery was vandalized, glass smashed, looted/robbed. This","region":"MN","shared_count":875,"campaign_state":"active","user":"Anastacia Lindholm","index":5},{"source":"gfm","image":"https://images.gofundme.com/H0QFlRhhdPu7DZBDZygWpUtZmRI=/640x480/https://d2g8igdw686xgo.cloudfront.net/48427110_1590915149164076_r.jpeg","hearts":5887,"launched":"2020-05-31T03:55:25-05:00","current":155962,"deactivated":false,"donations":5908,"donations_enabled":true,"goal":175000,"name":"For James Scurlock’s Family","id":"for-james-scurlocks-family","longDesc":"\n\n\n\n\nWe are creating this fundraiser for James Scurlock and his family. \n\n\n\n\n\n\n\n\n\n\nWho is James Scurlock?A 22 years old young black man who showed his dedication a love for his people every single day. \n\n\n\n\n\n\n\n\n\n\nJames was passionate for Justice, but today his fight ended as he was shot and killed downtown Omaha while protesting for the same Justice he deserves. \n\n\n\n\n\n\n\n\n\n\nMay you Rest In Peace James. \n\n Commonly asked Questions from GoFundMe and everybody else:\n\n Who are you?: I am Aimlys Esso, a member of the community of Omaha, Nebraska. \n\n What is your relationship with James Family or James?: I did not personally know James nor his family. \n\n Withdrawal plan to get funds to the beneficiaries: James Scurlock Sr.  has been set as the SOLE beneficiary of this fund. EVERY SINGLE LAST PENNY OF THIS FUND WILL BE GIVEN TO JAMES’ FAMILY. \n\n How will the funds be spent?: That is not for me to decide. This will be decided by James Family. \n\n I started this fundraiser thinking of how I could show support to the family, so I thank you all for helping  \n\n Thank you \n\n\n\n\n","desc":"\n\n\n\n\nWe are creating this fundraiser for James Scurlock and his family. \n\n\n\n\n\n\n\n\n\n\nWho is Jame","region":"NE","shared_count":20643,"campaign_state":"active","user":"Aimlys Esso","index":6},{"source":"gfm","image":"https://images.gofundme.com/qGfe_3PH9BH0vDWrn3jpgdjIVk8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431224_1590937286160752_r.jpeg","hearts":63,"launched":"2020-05-31T10:05:32-05:00","current":1983,"deactivated":false,"donations":65,"donations_enabled":true,"goal":3000,"name":"Fundraiser for small business destroyed","id":"fundraiser-for-small-business-destroyed","longDesc":"\nI’m raising money for a small business that was looted and destroyed last night. Tee is such a nice guy and didn’t deserve for his store to get ransacked. This is a black owned small business. We shouldn’t be tearing down what we are standing for.Stand by one another. \n\n\nAll proceeds will go to tee to help rebuild what was taken from him. \n","desc":"\nI’m raising money for a small business that was looted and destroyed","region":"NY","shared_count":572,"campaign_state":"active","user":"Billie Jean Starkweather","index":7},{"source":"gfm","image":"https://images.gofundme.com/0fD-4yhQev-Nuz9fQnODpo30EfE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48345040_1590602439903874_r.jpeg","hearts":368606,"launched":"2020-05-27T13:28:33-05:00","current":9638600,"deactivated":false,"donations":373877,"donations_enabled":true,"goal":1500000,"name":"Official George Floyd Memorial Fund","id":"georgefloyd","longDesc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear brother, George. My family and I watched in absolute horror as the now infamous and horrifying video began to spread quickly throughout social media. What we saw on that tape left us shell shocked; a white Minneapolis police officer kneeling directly on my brother's neck, obstructing his ability to breathe. As some officers knelt on his neck, other officers participated and watched; no one took any action to save my brother's life.  Those officers would continue to brutalize my brother until he died. This fund is established to cover funeral and burial expenses, mental and grief counseling, lodging and travel for all court proceedings, and to assist our family in the days to come as we continue to seek justice for George.  A portion of these funds will also go to the Estate of George Floyd for the benefit and care of his children and their educational fund. Anyone wishing to send cards, letters of encouragement  and/or contributions in the form of a money order or check, may do so by mail at: The Estate of George Floydc/o Ben Crump Law, PLLC122 S. Calhoun StreetTallahassee, FL 32301Attn: Adner Marcelin All checks must be made out to: The Estate of George Floyd  Commonly asked questions: 1. Who you are: Philonise Floyd, brother of George Floyd 2. Where you’re from? Houston, TX 3. Your relationship to the parties you’re raising funds for? George was my biological brother.  4. How the funds will be spent? Funds collected here will be spent by the Floyd family as outlined above. This fund will be governed and controlled at the discretion Philonise Floyd for the family's benefit. 5. How do you intend to get the funds to those in need? All funds collected on this website will be withdrawn to an established account for the benefit of my family. 100% of funds collected here will go to my family. 6. Are there any other legitimate funds? Yes, https://www.gofundme.com/f/george-floyd-bigfloyd is also a legitimate fund. Anyone with further questions about this page may contact Adner Marcelin of Ben Crump Law, PLLC at (850) 224-2020 or adner@bencrump.com.From the bottom of our hearts my family thanks each of you who have reached out. While we are not able to respond to each expression of love at this time,  please know that we love and appreciate each and every one of you. Our hearts are overwhelmed!- PhiloniseDisclaimer: Fund set up and managed by Adner Marcelin","desc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear b","region":"MN","shared_count":235004,"campaign_state":"active","user":"Philonise Floyd","index":8},{"source":"gfm","image":"https://images.gofundme.com/FB-mAdy5sXLScgSn9Mku0pmijMo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48436488_1590953687546704_r.jpeg","hearts":624,"launched":"2020-05-31T14:51:29-05:00","current":35495,"deactivated":false,"donations":626,"donations_enabled":true,"goal":80000,"name":"Help Black Owned Businesses rebuild","id":"help-black-owned-businesses-rebuild","longDesc":"After the events of the Downtown Oakland Riot, many Black Owned Businesses were vandalized by white influencers, undercover police officers, and members of the violent protest. This leaves these businesses having to come up with the money to pay for the things that they did not destroy. Some business can barely stay afloat right now with the pandemic going on and thus this expense could potentially shut down the store fronts of these businesses they built from the ground up. To preserve and restore these business, we are asking for any sort of monetary donation you can spare. This fund will go towards replacing broken windows, destruction of personal property in and outside of the establishments, and installation/equipment expenses.  Please share with everyone that you know and get this to exceed it's goal. Also feel free to leave the names of businesses that have been personally impacted so that we can reach out to them!","desc":"After the events of the Downtown Oakland Riot, many Black Owned Businesses were vandaliz","region":"CA","shared_count":181,"campaign_state":"active","user":"Jada Ross","index":9},{"source":"gfm","image":"https://images.gofundme.com/zyzU8GtO-0T9qkffXeo8hS2dJEE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48423410_1590894509718230_r.jpeg","hearts":123,"launched":"2020-05-30T22:38:35-05:00","current":3704,"deactivated":false,"donations":123,"donations_enabled":true,"goal":5000,"name":"Help Repair Buranko Cafe","id":"help-buranko-cafe","longDesc":"Buranko Cafe is a local POC owned Asian fusion restaurant that was broken into, vandalized, and robbed in the midst of the May riots in downtown Portland.  Run and owned by the family behind Phat Cart Cafe in SW Portland, Buranko has been a long term passion project for them. A ton of time, effort, and personal costs went into opening just earlier this year before being  temporarily shut down by COVID-19.The damages occurred during preparations to re-open on June 12th and have been a major setback in family income, in addition to supporting long time employees. Windows have been  broken, all delivery app tablets, and much of the restaurant's liquor stock have been stolen, adding up to around $5000 in expenses. They need your help, whether by donating funds, sharing this campaign, or supporting the still operating Phat Cart Cafe.  Please consider supporting local, and POC owned businesses during this crisis. Thank you!","desc":"Buranko Cafe is a local POC owned Asian fusion restaurant that was broken into, vandalized, and","region":"OR","shared_count":81,"campaign_state":"active","user":"Carter  Bryan","index":10},{"source":"gfm","image":"https://images.gofundme.com/b4gBzJ4Yl6yuCcfw-3LHcvMVN70=/640x480/https://d2g8igdw686xgo.cloudfront.net/48424532_1590899300815144_r.jpeg","hearts":159,"launched":"2020-05-31T10:54:36-05:00","current":9428,"deactivated":false,"donations":159,"donations_enabled":true,"goal":15000,"name":"Help for Carnicería La Huazteca destroyed by riots","id":"help-for-carniceria-la-huazteca-destroyed-by-riots","longDesc":"\nCarniceria La Huazteca, a locally-owned grocery store on Lake Street, suffered major damage during the riots in Minneapolis in response to the senseless and tragic murder of George Floyd. Owned by Alfredo Zagal and his wife Marcela, Carniceria La Huazteca has served the community for seventeen years.\n\n\nAs we’ve seen since the beginning of the pandemic, grocery workers are essential and have been disproportionately affected by the virus. Alfredo recently recovered from Covid-19 prior to the riots. Grocery workers like Alfredo have literally put their lives on the line to make sure we all have food to eat.On the evening of May 29th, rioters and looters broke into Carniceria La Huazteca, shattered windows, destroyed property, and stole merchandise and computers. Insurance only covers a fraction of the damage, so they desperately need help to rebuild.Despite their loss, they continue to support the peaceful protests and remain hopeful about the future of their small business, as well as our world at large. If you can help Alfredo and Marcela recover, any amount is helpful.\n\n\n**I am a Minneapolis resident and friend. Funds will go directly to Alfredo and Marcela to be used towards replacing merchandise, computers, etc and repairing their property. They will be able to access these funds directly as they will be appointed as beneficiaries.\n","desc":"\nCarniceria La Huazteca, a locally-owned grocery store on Lake Stre","region":"MN","shared_count":334,"campaign_state":"active","user":"Mackenzie Havey","index":11},{"source":"gfm","image":"https://images.gofundme.com/c8q0Mizg3iVfO2tCsEO_QfHrrBk=/640x480/https://d2g8igdw686xgo.cloudfront.net/48390046_1590978499660650_r.jpeg","hearts":1065,"launched":"2020-05-29T10:38:04-05:00","current":46502,"deactivated":false,"donations":1062,"donations_enabled":true,"goal":40000,"name":"HELP MINNEAPOLIS SMALL BUSINESSES!","id":"help-minneapolis-small-businesses","longDesc":"My name is Rob Smith. I am a verified public figure.Like many of you, I feel completely helpless when I see the destruction happening in Minneapolis right now. No matter what your politics are, many small businesses are being destroyed right now, and they were already struggling due to the closures caused by COVID-19.The only thing I can think to do is to use my platform to help benefit these people in any way I can. I give you my word that I will ensure that EVERY PENNY raised here goes to help these small business owners in some way. The funds will be used to rebuild, pay employees, or, for some, to perhaps restart entirely new businesses. Nobody deserves to have their livelihood destroyed.The world needs some love right now, and these people didn't ask for this, nor do any of them deserve to have their lives destroyed.Please help, spread this around, and I'm counting on the big names who will see this to help guide EVERY CENT raised to where it needs to be.Thank you.","desc":"My name is Rob Smith. I am a verified public figure.Like many of you, I feel completely h","region":"MN","shared_count":7478,"campaign_state":"active","user":"Rob Smith","index":12},{"source":"gfm","image":"https://images.gofundme.com/jId-CxQ2sSlVruUCqpyUPnq-3u8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48412692_1590855681359957_r.jpeg","hearts":225,"launched":"2020-05-30T11:36:59-05:00","current":5355,"deactivated":false,"donations":225,"donations_enabled":true,"goal":5000,"name":"Help small POC owned business recover from riot","id":"help-poc-owned-business-recover-from-riot","longDesc":"\nDuring the riots our small local POC owned business got vandalized and looted . They took about 5,000 worth of supplies , they took our cash registers broke windows ,and the damages created are going to take Us an incredible amount of time to recover from . We have put EVERYTHING into this business and we are devastated . We spent all night outside waiting for police or authorities to arrive and they never showed up ! Clearly it’s a situation that we are going to have to recover from alone but we greatly appreciate any help we can get ! \n\n\nplease spread the word and help a small   Local POC owned business recover from the distraction caused on may 29 2020 . A day we will never forget in Portland Oregon \n","desc":"\nDuring the riots our small local POC owned business got vandalized and","region":"OR","shared_count":440,"campaign_state":"active","user":"Arely Gonzalez","index":13},{"source":"gfm","image":"https://images.gofundme.com/0RAh5p30bMV8GP-5T0-5lWlAv-E=/640x480/https://d2g8igdw686xgo.cloudfront.net/48414634_1590863620246464_r.jpeg","hearts":300,"launched":"2020-05-30T14:47:11-05:00","current":9913,"deactivated":false,"donations":297,"donations_enabled":true,"goal":10000,"name":"Help Rebuild Michael's Soul Kitchen after Riot.","id":"help-rebuild-michael039s-soul-kitchen","longDesc":"Greatings Michael's Soul Kitchen Family!As you have recently learned, Michael's Soul Kitchen was vandalized on Friday May 29th during the aftermath of what started out as a peaceful protest in downtown Indianapolis.Michael's Soul Kitchen has been a proud partner with lo cal churches and community organizations to provide free meals to low income and COVID-19 affected seniors in our inner city and in assisted living facilities around the city. We provided these same meals to any families adversely affected by COVID-19! All this dispite the fact that Michael's Soul Kitchen has been closed for regular operations since late March. Michael's is Black owned and operated family restaurant struggling to remain a proud part of Downtown Indianapolis and an example to not just the black community, but to all; that by faith we can accomplish our dreams. We say \"THANK YOU: to all those who supported Michael's Soul Kitchen through your patronage while we were open and we sincerely appreciate your support in helping us stand strong and regroup following this malicious attack! We plan to come back and continue serving good Soulfood to go and our service to those in need. We look forward to serving you soon.❤ Romeo and Connie","desc":"Greatings Michael's Soul Kitchen Family!As you have recently learned, Mic","region":"IN","shared_count":2777,"campaign_state":"active","user":"Romeo Gerson","index":14},{"source":"gfm","image":"https://images.gofundme.com/HnBwIM0WPVTOxWu6UqwVC_BO60g=/640x480/https://d2g8igdw686xgo.cloudfront.net/48442212_1590972061413697_r.jpeg","hearts":147,"launched":"2020-05-31T19:45:52-05:00","current":7382,"deactivated":false,"donations":148,"donations_enabled":true,"goal":10000,"name":"Help Saucee Sicilian Rebuild After The Riots","id":"help-saucee-sicilian-rebuild-after-the-riots","longDesc":"The Saucee Sicilian is a local family owned food truck that is in the process of building a brick and mortar.  On May 30th their building was vandalized and looted during the peaceful protests that turned into a riot in front of their building. The clean-up effort and cost was thought to be covered by insurance, but since this falls under a 'riot' situation, it is now deemed extenuating circumstances and this family needs our help to cover the cost of clean up, items that were stolen and new windows. Any amount you give adds up. Thank you in advance for your support.  ","desc":"The Saucee Sicilian is a local family owned food truck that is in the process","region":"OK","shared_count":603,"campaign_state":"active","user":"Steve Brown","index":15},{"source":"gfm","image":"https://images.gofundme.com/r5N5GSWiGm3Tp5o-DqDQsoKfYt4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48449080_159099526140131_r.jpeg","hearts":102,"launched":"2020-06-01T02:20:29-05:00","current":2317,"deactivated":false,"donations":102,"donations_enabled":true,"goal":10000,"name":"Help SB Small Businesses Rebuild & Recover","id":"help-sb-small-businesses-rebuild-amp-recover","longDesc":"As someone born and raised in SB, I have so much love for this city. This city raised me and made me who I am. I know I speak for so many who live here that feel angered/disappointed at the direction that today’s protests took. I fully understand and support the need and the anger behind protests in support of the #blacklivesmatter movement and against police brutality. But I could never support looting against small, family owned, and home grown businesses. This page is set up in hopes to aid maybe one or two businesses that have been affected by looting. Please support and/or share this page!\n\n\nALSO, if any of you know of any businesses that could be benefited by any of this money raised, please notify me with their info so I can get into contact with them! ❤️\nMy phone number is (909) 553-4515. ","desc":"As someone born and raised in SB, I have so much love for this city. ","region":"CA","shared_count":70,"campaign_state":"active","user":"Esperanza Elizarraraz","index":16},{"source":"gfm","image":"https://images.gofundme.com/wbKQqNMCryARvLEhgrEF_uYKPBY=/640x480/https://d2g8igdw686xgo.cloudfront.net/46252622_1584675846241720_r.jpeg","hearts":138,"launched":"2020-03-19T22:26:41-05:00","current":11291,"deactivated":false,"donations":147,"donations_enabled":true,"goal":20000,"name":"West Coast Leather destroyed during riots","id":"help-support-small-businesses-west-coast-leather","longDesc":"\nWhen you create a business, you sign up to deal with the challenges that come along with that. However, most small business owners never imagine those challenges include a national pandemic and mass destruction. Not being open for 2 months was a challenge, then we were presented with riots and looters that destroyed our store, and stole more than half our inventory in the process. People are mad. We are mad. The injustice that is happening to our black community members is not fair. What happened to George Floyd was not fair. \n\n\nHowever, destroying small businesses isn’t the answer. Looting all our inventory isn’t the answer. The acts that have been taking place across the country are criminal and detrimental. When a small business takes a hit like this, it is nearly impossible to rebuild. We need your help. Please donate to our go fund me, and help us rebuild. We must come together as a community. \n\n\n************\n\n\n#SmallBusinessRelief \n\n\n3/20 My Dad, Stanley \"Skip\" Pas, is an amazing father, husband, friend and small business owner; he is the owner of West Coast Leather, a specialized store that offers custom-designed jackets for men &amp; women.  His goal has always been to make everyone he dresses feel AMAZING! Look good, feel good!\n\n\nMy dad has dedicated his years in the industry to running a successful small business while employing and providing stable income for his employees (special shout out to Joe Crane, who has been by his side for over 30 years!). \n\n\nAlong with other small businesses in San Francisco, West Coast Leather has been forced to shut their doors due to the Coronavirus (COVID-19).  WCL's storefront sits in Union Square, the historic heart of San Francisco, where rent and real estate is already extremely costly. Despite being closed to the public, rent payments are still due, over $10,000 per month. In December 2019, WCL lost their five year lease after a new commercial landlord took over their building.  My dad was forced to find a new store during peak Christmas season. The $25,000 down payment on the store’s new lease along with over $20,000 in moving expenses have depleted West Coast Leather’s entire emergency savings.The combined expenses of moving stores and being forced to close due to COVID-19 are absolutely devastating. My dad was so excited to be successful in this beautiful new storefront and start 2020 strong for his customers, colleagues and family. Instead, he is now facing over $30,000 of rent, with no incoming sales, as all non-essential businesses are closed through May. With West Coast Leather’s doors closed to the public, we are terrified of the prospect that we will close our doors for good.  It’s heartbreaking that due to this global pandemic, my dad may lose the livelihood he has dedicated his life to for over 30 years.\n\n\nFrom the bottom of our hearts, everything helps, and thank you so much for taking time out of your day to hear our story.\n\n\nhttps://www.westcoastleather.com/\n","desc":"\nWhen you create a business, you sign up to deal with the challenges that come ","region":"CA","shared_count":937,"campaign_state":"active","user":"Michelle Pas","index":17},{"source":"gfm","image":"https://images.gofundme.com/QfFu7PkPun-SpteiPssGH7oMOzA=/640x480/https://d2g8igdw686xgo.cloudfront.net/48464384_1591045590851621_r.jpeg","hearts":101,"launched":"2020-06-01T16:48:57-05:00","current":2713,"deactivated":false,"donations":102,"donations_enabled":true,"goal":10000,"name":"iNails & Spa Long Beach","id":"inails-amp-spa-long-beach","longDesc":"iNails &amp; Spa is a small business in Long Beach that has been destroyed by looters. Many of the stolen/damaged items include TVs, gel machines, the fountain, supplies (like nail polish), and even the religious statues. The owner of iNails &amp; Spa took all her life savings to open this nail shop. These ladies work so hard to survive. I've seen my mother Tina work 12-hour shifts and skipping meals. They don't deserve any of this. These women struggled enough as refugees, with losing their jobs through the pandemic, and now having their workplace destroyed. I am so heartbroken seeing these women cry as they visited the shop this morning. I truly want to thank anyone that has reached out and supported during this hard time. Any support, no matter how small, will be appreciated. The funds donated will go directly to the owner to help her rebuild the shop and fund for supplies. ","desc":"iNails &amp; Spa is a small business in Long Beach that has been destroyed by looters. Many of th","region":"CA","shared_count":102,"campaign_state":"active","user":"Kathy Nguyen","index":18},{"source":"gfm","image":"https://images.gofundme.com/5VJeAXs6DjTxfPqpV0Iq4q-MN6Q=/640x480/https://d2g8igdw686xgo.cloudfront.net/48413772_1590859863729931_r.jpeg","hearts":392,"launched":"2020-05-30T12:36:11-05:00","current":11197,"deactivated":false,"donations":390,"donations_enabled":true,"goal":5000,"name":"Juiced up vapors riot break in.","id":"juiced-up-vapors-riot-break-in","longDesc":"David Nettles is a African American man who has built his business from his garage at home, this is a family owned business, as people in Eugene, OR, last night decided to protest for the justice of George Floyd, while breaking into this innocent black mans shop as this is what he does on a daily basis to support his family and the ones he loves. He is extremely devastated at the actions that happened and took place last night. We are asking for this money to help with the repairs and justice for our family as this is not the first break in that has occurred.","desc":"David Nettles is a African American man who has built his business from his garage at ho","region":"OR","shared_count":2905,"campaign_state":"active","user":"David Nettles","index":19},{"source":"gfm","image":"https://images.gofundme.com/gCKmqLn8Y9eHoWDpNBNHfjo8G-A=/640x480/https://d2g8igdw686xgo.cloudfront.net/48462156_1591040330568538_r.jpeg","hearts":10375,"launched":"2020-06-01T15:00:39-05:00","current":236194,"deactivated":false,"donations":10419,"donations_enabled":true,"goal":200000,"name":"Justice for David McAtee","id":"justicefordavidmcatee","longDesc":"This is David McAtee. Also known as “Yaya” &amp; the “BBQ man”.David McAtee was killed this morning in Louisville, Kentucky. He was a black restaurant owner in the community who was fatally shot by authorities around midnight on June 1st. As of 10:45 AM, his body was still lying in the streets. The National Guard had been deployed in Kentucky surrounding the protests, yet McAtee's death occurred at 26th and Broadway.... far far away from any of the protesting.  Kentucky Governor Andy Beshear had called on law enforcement to release the body cam footage of the shooting... but of course, their body cams were turned OFF. We should be absolutely horrified by this man's death and also by the fact that his body was left in the street for 12 hours after the shooting. There is no goal to reach and there is no dollar amount that will ever equal David's life, so this campaign will do everything in its power to secure as many relief funds as possible for the McAtee family. His mother also lost a daughter earlier this year.  As well as doing anything you can to donate to black-led organizations focused on ending police brutality, I urge you to give what you can to this cause. 100% of funds will be donated to the family to help funeral and memorial funds. As well as funding any legal action that may be taken against the city.Frequently asked:  Who are you? Aida Osman. I'm a writer and social organizer.   How are you connected to David McAtee? I am not related to the family. I found this story this morning and wanted to help spread it on social media and get funds for the family. I have just made contact with a family friend who will get 100% of the funds to Odessa Riley, David McAtee's mother.  How the funds will be spent? The money will be spent at the discretion of the McAtee family.","desc":"This is David McAtee. Also known as “Yaya” &amp; the “BBQ man”.David McAtee was killed this mornin","region":"KY","shared_count":4186,"campaign_state":"active","user":"Aida Osman","index":20},{"source":"gfm","image":"https://images.gofundme.com/uEAO8ckiKWR6Hbf2ormmwvQSLVU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431340_1590937399616239_r.jpeg","hearts":1463,"launched":"2020-05-31T10:10:54-05:00","current":119791,"deactivated":false,"donations":1470,"donations_enabled":true,"goal":50000,"name":"La Mesa Business Disaster Recovery","id":"la-mesa-business-disaster-recovery","longDesc":"Rebuild La Mesa - Donate to help small businesses affected by the riots last night. The East County Chamber of Commerce Foundation is establishing a relief effort to help the small businesses that were destroyed in the riots on the night of Saturday, May 30 2020.Our small businesses are devastated and many were already on the brink due to COVID19. La Mesa Village has been the heart of small business in the city and is a beautiful place for dining, events and memories.All proceeds will go directly to small businesses that were destroyed or damaged. The Chamber Foundation is a non-profit organization that has been helping East County for over 26 years.","desc":"Rebuild La Mesa - Donate to help small businesses affected by the riots last night. The ","region":"CA","shared_count":8514,"campaign_state":"active","user":"Phil Ortiz","index":21},{"source":"gfm","image":"https://images.gofundme.com/Qb7tatBrX2SwNp8akk98MiJlT2Y=/640x480/https://d2g8igdw686xgo.cloudfront.net/48391624_1590771096627363_r.jpeg","hearts":1009,"launched":"2020-05-29T11:56:53-05:00","current":64596,"deactivated":false,"donations":1002,"donations_enabled":true,"goal":100000,"name":"Lloyd's Pharmacy Rebuilding Fund - St. Paul Riots","id":"lloyd039s-pharmacy-rebuilding-fund-st-paul-riots","longDesc":"The first drug store in Hamline, Minnesota opened in 1918 as Florian's Pharmacy. Although the name changed in 1949 to Lloyd's Pharmacy, this independent locally owned and operated pharmacy has been a staple in the St. Paul community for over 100 years. Sadly, due to rioters in the area, the store was looted and destroyed by fire in the early morning on May 29th. To help the owners rebuild, and continue to take care of the patients in the community, we are raising funds for this great community icon to help them as much as they've helped the community over the years.Any donations are appreciated and will go back to rebuilding the pharmacy so that it can keep supporting the community.LIVE LOVE LLOYD'S!!!Update - We have been overwhelmed by the support from our community and abroad!  We can't put in to words how much it means to Lloyd's Pharmacy!  Thank you!!!","desc":"The first drug store in Hamline, Minnesota opened in 1918 as Flori","region":"MN","shared_count":10581,"campaign_state":"active","user":"Philip Hommerding","index":22},{"source":"gfm","image":"https://images.gofundme.com/WHbGKo6LOaFLPyefh5Lp3QEZeM8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48435484_1590962409179002_r.jpeg","hearts":497,"launched":"2020-05-31T15:14:09-05:00","current":28412,"deactivated":false,"donations":497,"donations_enabled":true,"goal":75000,"name":"Local Melrose store looted & burned during riots.","id":"local-melrose-store-looted-amp-burned-during-riots","longDesc":"A recently widowed, 81 year old, long time Melrose business owner lost everything he had during the George Floyd protest on May 30, 2020. Rioters broke into the store, looted everything, and set the store on fire causing unrepeatable damage. The store is currently burned to ashes. The store was the only thing he had to keep him going, he has now lost everything that allowed him to survive. His only source of income was the store, unfortunately insurance is not covering the damages caused by the riot. Not only has he lost his only source of income, now he has no way to pay his rent and other expenses the store has allowed him to pay.","desc":"A recently widowed, 81 year old, long time Melrose business owner lost eve","region":"CA","shared_count":1586,"campaign_state":"active","user":"Ebbi Ebbi","index":23},{"source":"gfm","image":"https://images.gofundme.com/HcbNeVmjT27vKVyOwo3HE91S14Y=/640x480/https://d2g8igdw686xgo.cloudfront.net/48414400_1590861863374779_r.jpeg","hearts":100,"launched":"2020-05-30T13:10:34-05:00","current":6385,"deactivated":false,"donations":97,"donations_enabled":true,"goal":10000,"name":"Lynn Nguyen and Brent Collier riot relief","id":"lynn-nguyen-and-brent-collier-riot-relief","longDesc":"My dear friends and neighbors Brent Collier and Lynn Nguyen lost all of their inventory last night in the Portland Rioting. Their store was vandalized and looted.Rent is due and they now have no inventory . They had reinvented themselves and were making Face Masks ,All of them were stolen last night. Any donations would help to begin to replace that inventory. We are all struggling now so if you can help please do .If you help can't please just pray .We all need love ,care and prayer right now.","desc":"My dear friends and neighbors Brent Collier and Lynn Nguyen lost all of th","region":"OR","shared_count":378,"campaign_state":"active","user":"Kathleen Boniface","index":24},{"source":"gfm","image":"https://images.gofundme.com/ZfpONWBCPh1mIjFBjZNMTSY1kDY=/640x480/https://d2g8igdw686xgo.cloudfront.net/48455742_1591025631729829_r.jpeg","hearts":127,"launched":"2020-06-01T10:35:47-05:00","current":7903,"deactivated":false,"donations":130,"donations_enabled":true,"goal":5000,"name":"Miami Fusion Cafe Riot Recovery","id":"miami-fusion-cafe-riot-recovery","longDesc":"You see this little restaurant right here! It has been part of the Downtown Birmingham scene for some time now. It has been awarded time and time again as one of the top food destinations in the city. This store plus the El Conquistador food truck not only feeds paying repeat dedicated customers but is also a ministry to the homeless and to help those recovering from addictions. During this pandemic the store has been closed, but the food truck has been rolling all over the city to feed first responders and Frontline workers.The owners of this establishment are hard working God fearing people the truly do His work. You have no money for lunch...they will feed you. You have no way to get there...they bring it to you. They each have come from places in their lives from which they had demons to overcome. From ZERO they have built their lives.This is the source for income for this family. They support 4 kids from the income from this restaurant.This restaurant was severely damaged in the riots and looting that have spilled over from Minneapolis. Thankfully they still have the food truck and I'm sure will continue to serve as they have with faith in God to see them thru. How do I know these things about this family? Its my sister and my Brother in law.","desc":"You see this little restaurant right here! It has been part of the Downtown Birmingha","region":"AL","shared_count":673,"campaign_state":"active","user":"Amanda Gail Russ","index":25},{"source":"gfm","image":"https://images.gofundme.com/CajwVovLw4xNlhwLmyQ6slz7OOw=/640x480/https://d2g8igdw686xgo.cloudfront.net/48364082_1590675056487836_r.jpeg","hearts":357,"launched":"2020-05-28T09:38:55-05:00","current":15006,"deactivated":false,"donations":357,"donations_enabled":true,"goal":20000,"name":"Minneapolis Riots Took Everything","id":"minneapolis-riots-took-everything","longDesc":"I am sure everyone in the world has now heard about or seen the video of a Minneapolis Minnesota man’s life senselessly ended by the overuse of force by a Minneapolis  police officer. We were all disgusted and heartbroken by this event as it played out over social media and news outlets everywhere.  Within hours the citizens of that area took to the streets in protest. A few days later that protest turned into violence, looting, and arson.  Bre Lenton, a Salon Manager was living in the heart of the riots on the second floor of an apartment building.  Beneath her were the shops and stores that we all watched as looters picked them apart.  Early into Thursday morning, the looting turned into arson. These rioters armed with crowbars, first broke into her building attempting to take everything in it. Bre, with her fellow tenants literally fought them off pushing them out of the doorway. Shortly after not being able to gain access to the apartment, and after emptying the stores below the building of everything, the rioters had only one destructive thing left that they could do. They lit the building on fire.  Bre could only watch in horror as the home she had just moved into a week prior and literally everything she owned was about to be taken from her.  Fearing for her life, she grabbed her two cats and fled for their lives. Thankfully she was able to reach her car and escape the area alive. Due to the Pandemic, Bre, like so many others has been laid off for 2 months. Just two days after she returned to works Bre, a single mother, great friend, and an amazing human is about to start over. Upon returning to her apartment this May 28th morning she was able to save most of her things although there is smoke damage and virtually every door has been smashed in and broken down by looters, her home is not inhabitable.  I am asking anyone who can to help donate so she can try to rebuild her life and find a new place to live.","desc":"I am sure everyone in the world has now heard about or seen the video of a Minneapolis","region":"MN","shared_count":2648,"campaign_state":"active","user":"Randy Herreid","index":26},{"source":"gfm","image":"https://images.gofundme.com/INv5-FJByGM__7xBUm1onpgGl58=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431000_159094192588008_r.jpeg","hearts":2914,"launched":"2020-05-31T11:22:34-05:00","current":153445,"deactivated":false,"donations":2937,"donations_enabled":true,"goal":250000,"name":"Du Nord Riot Recovery Fund","id":"minnesota-poc-business-support","longDesc":"On the evening of May 25th, 2020, George Floyd was killed by Minneapolis Police. Thousands of people have come to the street to protest and make their voices heard. Following the beautiful peaceful protests, riots overtook the city and the Lake Street Corridor:a beacon for multiculturalism, black and brown entrepreneurship and the rise of family owned businesses. Much is lost.We have received a tidal wave of love and support from across the nation and many have asked how they can help. Thanks to the support we have received and an impending insurance claim, we feel funds would be better directed to our sister businesses in distress. Therefore, Du Nord is establishing this fund to support black and brown companies affected by the riots. In the coming days we will add to the leadership team to bring in more business owners and community leaders.  We are dedicated to rebuilding Minneapolis in a way that ensures our cultural beacons are restored.- Du Nord Craft Spirits owner, Chris Montana","desc":"On the evening of May 25th, 2020, George Floyd was killed by Minneapolis Police.","region":"MN","shared_count":4255,"campaign_state":"active","user":"Chris and Shanelle Montana","index":27},{"source":"gfm","image":"https://images.gofundme.com/vGf8uVbQRZ4KrASf7EWuHzZJmZ4=/640x480/https://i.ytimg.com/vi/f4WDjxCP1Fs/0.jpg","hearts":357,"launched":"2020-05-30T20:55:15-05:00","current":15736,"deactivated":false,"donations":357,"donations_enabled":true,"goal":10000,"name":"Essentials and Delivery for Stephanie Wilford","id":"neighbors4stephanie","longDesc":"On Saturday, May 30, Ben Henry of KSTP did a powerful interview with Minneapolis resident Stephanie  Wilford regarding the destruction of local businesses due to ongoing riots following the death of George Floyd.  In the interview, Stephanie indicated the only stores she can shop at were destroyed and she has no access to public transportation because of closures.Her powerful words struck the hearts of many neighbors near and far on social media who want to help.  I am Jill, a fellow Minneapolis neighbor.  Her story brought me to tears and I wanted to do something to help. After encouragement on social media through Twitter - I reached out to Stephanie for approval to establish this Go Fund Me. This is an opportunity to provide relief through donations to Stephanie to help get essentials/transportation to shop (perhaps Shipt or Amazon subscriptions). The response and willingness to help Stephanie financially as well as in person has been overwhelming. Another neighbor, Ann, and myself have been working together and in regular contact with Stephanie to define the best way to use the resource. Additionally, KSTP/Ben Henry have recieved many inquiries on the best way to help her and her neighbors. We are all working to find the best solutions and more information will be available in the coming days. Read the story/watch the interview here: https://kstp.com/minnesota-news/minneapolis-twin-cities-community-reaction-riots/5745543/?cat=1. Thank you to Ben for your important reporting.","desc":"On Saturday, May 30, Ben Henry of KSTP did a powerful interview with Minneapol","region":"MN","shared_count":557,"campaign_state":"active","user":"Jill Sims","index":28},{"source":"gfm","image":"https://images.gofundme.com/twBm3RUYxMcJY-mss5oIzSvJalo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48441600_159096816183993_r.jpeg","hearts":5,"launched":"2020-05-31T22:59:41-05:00","current":195,"deactivated":false,"donations":5,"donations_enabled":true,"goal":30000,"name":"Philadelphia Black Owned Business Relief","id":"philadelphia-black-owned-business-relief","longDesc":"This fundraiser is for Philadelphia Owned Black Business Owners affected by the protests, riots, and looting. You must be a verified Philadelphia Black Business owner to receive support. Please donate whatever you can donate! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We begin supporting and rebuilding our community by having one another during these times. Our goal is to support the city of Brotherly Love, however other cities are in consideration so if you know any businesses in other cities please let us know and donate!","desc":"This fundraiser is for Philadelphia Owned Black Business Owne","region":"PA","shared_count":0,"campaign_state":"active","user":"Philadelphia Black Owned Business Relief","index":29},{"source":"gfm","image":"https://images.gofundme.com/fRo6AzSI0rU5stsvQXP4rrZ6iYc=/640x480/https://d2g8igdw686xgo.cloudfront.net/48459544_1591034375384458_r.jpeg","hearts":697,"launched":"2020-06-01T13:05:06-05:00","current":13706,"deactivated":false,"donations":697,"donations_enabled":true,"goal":25000,"name":"FUNDS FOR DESTROYED BLACK OWNED BUSINESS","id":"protesters-and-bond-funds","longDesc":"Hi I am Meriyah Smith from Atlanta Georgia We are working with Current members from Black Lives Matter In the Atlanta ,New York, and  Dallas are to help individuals putting there life on the line everyday . These funds will be withdrawn  to member Alec Bailey because he is  a current individual who is in contact with all the  members from different areas and he will distribute to those three areas to help our fellow African Americans who has lost there businesses due to city riots and also our protestors who are getting arrested. Some of our African Americans spent there whole life to make it out and we out hurting our own kind. #blacklivesmatter","desc":"Hi I am Meriyah Smith from Atlanta Georgia We are working with Current members ","region":"GA","shared_count":531,"campaign_state":"active","user":"Meriyah Smith","index":30},{"source":"gfm","image":"https://images.gofundme.com/nK2K6LpRDqchKnCEq9nbcS3Twlg=/640x480/https://d2g8igdw686xgo.cloudfront.net/48397592_1590787150859815_r.jpeg","hearts":3102,"launched":"2020-05-29T16:50:41-05:00","current":134440,"deactivated":false,"donations":3101,"donations_enabled":true,"goal":100000,"name":"Rebuilding Bole Ethiopian Cuisine","id":"rebuilding-bole-ethiopian-cuisine","longDesc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  As we silently watched our beloved Bolé went up in flames, it was heartbreaking to witness, what we all considered our home, reduced to ashes. What is positive? It is witnessing the overwhelming messages and well wishes that Solomon, Rekik, and the Bolé staff have received.  And we thank you, on behalf of the entire family for standing with us when everything else seems like it has fallen beneath our feet. It is comforting to know that we are not alone in thinking that Bolé was not just a restaurant for us, Bolé was the pillar of the community. Bolé was our home away from home. Because your feedback to this unspeakable misfortune is to rise up, to rebuild, and to become the Bolé you all are accustomed to. And with your unyielding support, we are confident will have you dining at your clean tables in no time. As you might have also known, the irreplaceable damage was not only caused to Bolé restaurant. Bolé Express, the fast food version of the Bolé franchise, due to open on Sunday, May 31st, 2020 was also burned to the ground. Solomon and the entire crew spent the last 8 months building Bolé Express and they are incredibly proud of the vision to offer an alternative to our busy customers by grabbing their meals with a 2-minute turn around service. From the start, Bolé was a community driven business, this misfortune has taught all of us that community is what we all have when everything else is stripped away. Therefore, upon the overwhelming request by many of you, we have set up this platform so that you can donate for the initiation of the ‘Re-building Bolé’ project as you see fit. THANK YOU AND PLEASE CONTINUE TO KEEP THE BOLÉ FAMILY IN YOUR PRAYERS.- Family and Friends Additional information:  About the restaurant owners:Solomon and Rekik are active members of their community and they used Ethiopian food to connect people from all over the world.  They have two beautiful children.  While the situation has hit the family hard, they are not the type to lose hope.  About the organizers: The GoFundme account was created at the request of family members of Solomon and Rekik and community partners including Zehabesha (Henok Degfu), Dr. Sirak Hailu, and many other local supporters. My name is Lelna and I have had the privilege to work with Solomon and Rekik to strategize, build &amp; expand their business over the past 2 years in St. Paul, Minnesota. They are extremely hard-working individuals that are ready to get back to work. Bole as a whole was a family to many, including all the employees. In our best interests to support them during this difficult time, the community has come together to rebuild Bole. Our goal is to use the funds to build Bole - a restaurant that was a home away from home for many and a place of security and employment for the staff. The money raised will go directly to the Bole business owners via their business account where the owners will use it to start building a new business. In their own words - \"We want to build something that the community can be proud of and will call it their own.\"","desc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  As we","region":"MN","shared_count":5944,"campaign_state":"active","user":"Lelna Desta","index":31},{"source":"gfm","image":"https://images.gofundme.com/YzQh1XepzFdf9pX6yjv3U8x_Ns4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48424366_1590898497504932_r.jpeg","hearts":444,"launched":"2020-05-30T23:17:02-05:00","current":27235,"deactivated":false,"donations":444,"donations_enabled":true,"goal":15000,"name":"Restore JapanLA","id":"restore-japanla","longDesc":"JapanLA  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide that live and breathe cute culture. During the evening of May 30th, JapanLA was LOOTED and VANDALIZED by rioters following the protest march throughout Los Angeles. Our hearts, like many of you, are broken seeing the footage that was broadcast on television. Through this GoFundMe, we hope to help our friend Jamie to rebuild this storefront to once again shine on Melrose Ave. JapanLA holds a special place in our hearts and the hearts of many others around the world. Now is the time for us to come together and help JapanLA rebuild their beautiful store that they have worked so hard to make a safe and fun space for us all. These donations will help cover the major cosmetic damages and loss of merchandise in addition to help from the effects of COVID-19. Let's show up for them the way they have for us for over 10 years. If you have the means to make a donation, anything helps. If not, we encourage you to support them by sharing this page or by sharing a moment you've had with JapanLA   that's brought you joy.Love,Chrissa Sparkles and Jon (KawaiiGuy)","desc":"JapanLA  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide t","region":"CA","shared_count":3054,"campaign_state":"active","user":"Jon Brence","index":32},{"source":"gfm","image":"https://images.gofundme.com/SlTIl-Zcnowwb70zQJb2fBUnbIs=/640x480/https://d2g8igdw686xgo.cloudfront.net/48433164_159094498973697_r.jpeg","hearts":548,"launched":"2020-05-31T12:13:47-05:00","current":18729,"deactivated":false,"donations":547,"donations_enabled":true,"goal":50000,"name":"Riot damages to Waller & Company Jewelers","id":"riot-damages-to-wallers-and-company","longDesc":"This is fundraiser to support a local black business that was deeply affected by the riots/protest against police brutality. Waller &amp; Company has been in the black Richmond community for 120 years. Any donation would be a great help to rebuild and protect his business!","desc":"This is fundraiser to support a local black business that was deeply affecte","region":"VA","shared_count":1298,"campaign_state":"active","user":"Wallers Company","index":33},{"source":"gfm","image":"https://images.gofundme.com/IGl2y_lErqtzGOJenHhMZ1e5lps=/640x480/https://d2g8igdw686xgo.cloudfront.net/48417542_159087210273038_r.jpeg","hearts":68,"launched":"2020-05-30T16:05:22-05:00","current":4189,"deactivated":false,"donations":68,"donations_enabled":true,"goal":10000,"name":"Small Business Destroyed in Atlanta Riots","id":"small-business-destroyed-in-atlanta-riots","longDesc":"Already suffering from three months of business closure due to COVID-19, my dad has been anxious for things to start calming down so he can reopen and make up for all the lost business. He is an immigrant who came to the US to give his family a chance at a better life, and now he lost his business.Late at night on May 29, his store got broken into and looted, causing an even larger setback for him that he cannot recover from on his own. Since he was unable to afford any insurance and has no coverage to fall back on, my only hope is kind people being able to lend a helping hand.Please consider helping out so he can begin repairing his store and replacing merchandise to reopen as quickly as possible to keep the family afloat. No amount is too small; I would appreciate any and all help you could afford to give. Thank you all.Thanks again for your support!Created by Moe's children to lend our dad support.","desc":"Already suffering from three months of business closure due to COVID-19, my ","region":"GA","shared_count":103,"campaign_state":"active","user":"Armaan Esfahani","index":34},{"source":"gfm","image":"https://images.gofundme.com/2Cpsn7obww5A7SvP2NRi2m6bYO4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48397092_1590788789736326_r.jpeg","hearts":332,"launched":"2020-05-29T18:35:08-05:00","current":9601,"deactivated":false,"donations":336,"donations_enabled":true,"goal":20000,"name":"Small Family Business looted in Minneapolis","id":"small-family-business-looted-in-lake-street-riot","longDesc":"Our lake street business was looted and destroyed during the early hours on Thursday, May 28th following the death of George Floyd on Monday, May 25th. Our small immigrant-owned family business is located at 417 E Lake Street #25-26 inside of Lake Plaza/Plaza Mexico and has proudly served the south Minneapolis community for over 10 years. Due to the COVID-19 Pandemic, we had to temporarily close our doors for two months and in doing so we took a big loss in income. Just a week ago, our doors were allowed to open once again, and to prepare for the re-opening of our shop, we took on a significant amount of debt to bring merchandise to fill our shelves.Over $20,000 worth of products and property was stolen or damaged. Our dream is to start over again and to do so, we ask the community to please help us get back on our feet by donating anything you can and sharing this were ever you can. We understand that these are difficult times that we as a community are living through and we are eternally grateful for all the love and support. The funds will go to pay off debts, pay for property damages and help us get started once again. Thank you once again, God Bless. Nuestro negocio de Lake Street fue saqueado y destruido durante las primeras horas del jueves 28 de mayo luego de la muerte de George Floyd el lunes 25 de mayo.Nuestro pequeño negocio familiar de propiedad de inmigrantes está ubicado en 417 E Lake Street # 25-26 dentro de Lake Plaza / Plaza México y ha servido con orgullo a la comunidad del sur de Minneapolis por más de 10 años.Debido a la pandemia de COVID-19, tuvimos que cerrar temporalmente nuestras puertas durante dos meses y, al hacerlo, tuvimos una gran pérdida de ingresos. Hace solo una semana, se permitió que nuestras puertas se abrieran una vez más, y para prepararnos para la reapertura de nuestra tienda, asumimos una cantidad significativa de deuda para traer mercancías para llenar nuestros estantes.Más de $ 20,000 en productos y propiedades fueron robados o dañados. Nuestro sueño es comenzar de nuevo y, para hacerlo, le pedimos a la comunidad que nos ayude a volver a ponernos de pie donando todo lo que pueda y compartiendo esto siempre que pueda. Entendemos que estos son tiempos difíciles que nosotros como comunidad estamos viviendo y estamos eternamente agradecidos por todo el amor y el apoyo.Los fondos se destinarán a pagar deudas, pagar daños a la propiedad y ayudarnos a comenzar una vez más. Gracias una vez más, Dios los bendiga.","desc":"Our lake street business was looted and destroyed during the early hours ","region":"MN","shared_count":155,"campaign_state":"active","user":"Adrian Gutierrez","index":35},{"source":"gfm","image":"https://images.gofundme.com/T7LkHPJUqzuLwE3BjYRS0YGhptQ=/640x480/https://d2g8igdw686xgo.cloudfront.net/48443024_1590993897110285_r.jpeg","hearts":427,"launched":"2020-05-31T19:54:42-05:00","current":41269,"deactivated":false,"donations":434,"donations_enabled":true,"goal":250000,"name":"Help Us Rebuild Sunny Optometry Destroyed by Riots","id":"sunny-optometry-santa-monica-destroyed-by-riots","longDesc":"The team at Sunny Optometry was overwhelmingly excited to welcome back patients after a two month closure from the COVID-19 pandemic. After months of grueling planning, we managed to safely reopen our doors to serve our community and restore our teams’ lost jobs. On Sunday May 31st, only two weeks after reopening, waves of brazen rioters and looters destroyed all that our team has built since 1985. Previously the office of Dr. Weintraub, we have always endeavored to provide superior eye care and deliver a bespoke experience. Dr. Sun, Dr. Sjolund, and the team have invested countless hours to nurture a unique patient experience, and regretfully must inform all patients that Sunny Optometry must again close until further notice to repair the extensive vandalism. We want the community to know that every member of the Sunny Optometry team is from a minority group. We are Asian, Black, Hispanic, and 90% women operated. We are your neighbors, friends, and family. On the eve of our 1 year anniversary from transitioning from Dr. Weintraub to Sunny Optometry, our hopes and dreams were crushed by having to close our doors for the second time in 2020.Dr. Sun is a first generation immigrant who spent every single summer, winter, and spring break working to help financially support her family. She grew up with the impression that American dream could be achieved through diligence and education, and became an optometrist. She met her husband Dr. Sjolund in optometry school, and together they poured their heart, soul, and life savings into their practice.Amid the start of a protest in downtown Santa Monica, all day we helplessly witnessed our life’s work vandalized, stolen, and burned. The looters were so thorough they stole everything including receipt paper, pennies, and lint in our drawers before setting it all ablaze. We are eternally grateful for the brave police and firefighters who managed to mitigate the damage and prevent the office from becoming a pile of ash. Sunny Optometry is independently owned, and our team greatly appreciates any assistance as we try to rebuild during these unprecedented times. Please visit our website and we encourage you share with others so other business owners can protect themselves.Click to Visit Sunny Optometry Website","desc":"The team at Sunny Optometry was overwhelmingly excited to welcome b","region":"CA","shared_count":4410,"campaign_state":"active","user":"Sunny Optometry","index":36},{"source":"gfm","image":"https://images.gofundme.com/Z0_1Q6WpU-p2DOXPOkmjWw1703k=/640x480/https://d2g8igdw686xgo.cloudfront.net/48366792_1590686367219182_r.jpeg","hearts":1025,"launched":"2020-05-29T12:39:36-05:00","current":39496,"deactivated":false,"donations":1030,"donations_enabled":true,"goal":60000,"name":"Destruction of Family Run Business During Riots","id":"vandilization-of-family-run-business-during-riots","longDesc":"My name is Javier Tamay, and I am a Junior at Great River School in St. Paul. I am trying to raise money for my uncle's (Jose Tamay) business - El Sabor Chuchi . Last night during the Lake Street riots following the murder of George Floyd, his business was vandalized, and three large store windows were shattered and his store was looted. This isn’t the first time that Jose’s business has been broken into, his store was robbed and looted just a few weeks ago while shut down due to COVID-19. See news story below:News Story Also, last year in June, Jose hired someone to install a new exhaust hood in his restaurant location, but the man who was to install it, disappeared. Jose lost $15,000 cash. Jose sued, he won the court case, but almost a year has passed and he hasn’t received any money.Jose is a really hard working man who works 7 days a week, 13 hours a day, from 8am to 9pm. He does everything he can to provide for his wife and two kids. Being an immigrant, Jose doesn’t have access to bank loans or stimulus money. All the money used to create his business was saved from working long hours as a cook/dishwasher.Raising money for Jose is important to me because he has worked so hard to create two small, successful businesses and always has a positive attitude despite many setbacks. He is such an inspiring and amazing person, and it's really hard to see him get knocked down so many times.As a part of the International Baccalaureate (IB) education track I am enrolling in, community involvement is an important part of my education. I am particularly passionate about the plight of immigrants. Through this fundraiser, I hope to spread awareness of how much immigrants are both directly and indirectly targeted and taken advantage of. Please help me show kindness to some of our city’s most vulnerable citizens.Your donation will go directly to Jose and his family to help replace three broken storefront windows and to recoup a portion of his losses. In addition, your financial support will provide a much needed sense of security and community to this family. Please share with your friends and family even if you are unable to donate.","desc":"My name is Javier Tamay, and I am a Junior at Great River School in St. P","region":"MN","shared_count":1547,"campaign_state":"active","user":"Javier Tamay","index":37},{"source":"gfm","image":"https://images.gofundme.com/uiTd1Pz3vXUgP2co0McUV-11rXo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48457258_1591029069245794_r.jpeg","hearts":6074,"launched":"2020-06-01T11:34:41-05:00","current":109641,"deactivated":false,"donations":6079,"donations_enabled":true,"goal":100000,"name":"Zahalea Anderson","id":"zahalea-anderson","longDesc":"Zahalea Anderson/ Zahalea Showe lost her business in Long Beach, California yesterday. 25 years in this building running her School of Self Defense, and now it’s been lost to the only fire in Long Beach. It is easy to say “Black Lives Matter,” but if we do not rally behind our black brothers and sisters in times of need then our words are EMPTY. 100% of this fundraiser will be going directly to Zahalea Anderson/Showe to rebuild and reopen her business. I’m in contact with Zahalea and she is the sole beneficiary of the funds raised by this campaign. ","desc":"Zahalea Anderson/ Zahalea Showe lost her business in Long Beach, California yesterday. 25 years in this b","region":"CA","shared_count":1363,"campaign_state":"active","user":"Marie Hosep","index":38}],"regions":{"AL":{"byHearts":[25],"byLaunched":[25],"byRaised":[25],"byDonations":[25],"byGoal":[25],"byRemaining":[25],"byPercent":[25],"bySharedCount":[25]},"CA":{"byHearts":[18,16,17,36,32,23,9,1,21,38],"byLaunched":[17,32,1,21,9,23,36,16,38,18],"byRaised":[16,18,17,32,23,9,36,1,38,21],"byDonations":[16,18,17,36,32,23,9,1,21,38],"byGoal":[16,18,32,17,21,23,9,1,38,36],"byRemaining":[36,23,9,1,17,16,18,38,32,21],"byPercent":[36,16,18,23,9,17,1,38,32,21],"bySharedCount":[16,18,9,1,17,38,23,32,36,21]},"GA":{"byHearts":[34,30],"byLaunched":[34,30],"byRaised":[34,30],"byDonations":[34,30],"byGoal":[34,30],"byRemaining":[30,34],"byPercent":[34,30],"bySharedCount":[34,30]},"IL":{"byHearts":[4],"byLaunched":[4],"byRaised":[4],"byDonations":[4],"byGoal":[4],"byRemaining":[4],"byPercent":[4],"bySharedCount":[4]},"IN":{"byHearts":[14],"byLaunched":[14],"byRaised":[14],"byDonations":[14],"byGoal":[14],"byRemaining":[14],"byPercent":[14],"bySharedCount":[14]},"KY":{"byHearts":[20],"byLaunched":[20],"byRaised":[20],"byDonations":[20],"byGoal":[20],"byRemaining":[20],"byPercent":[20],"bySharedCount":[20]},"MN":{"byHearts":[11,5,35,26,28,3,22,37,12,27,31,8],"byLaunched":[8,26,3,12,22,37,5,31,35,28,11,27],"byRaised":[11,35,5,26,28,37,3,12,22,31,27,8],"byDonations":[11,5,35,26,28,3,22,37,12,27,31,8],"byGoal":[28,11,5,26,35,12,3,37,22,31,27,8],"byRemaining":[27,22,37,35,5,3,11,26,28,12,31,8],"byPercent":[35,5,27,11,22,37,26,3,12,31,28,8],"bySharedCount":[35,11,28,5,37,3,26,27,31,12,22,8]},"NE":{"byHearts":[6],"byLaunched":[6],"byRaised":[6],"byDonations":[6],"byGoal":[6],"byRemaining":[6],"byPercent":[6],"bySharedCount":[6]},"NY":{"byHearts":[7,0],"byLaunched":[7,0],"byRaised":[7,0],"byDonations":[7,0],"byGoal":[7,0],"byRemaining":[0,7],"byPercent":[7,0],"bySharedCount":[0,7]},"OH":{"byHearts":[2],"byLaunched":[2],"byRaised":[2],"byDonations":[2],"byGoal":[2],"byRemaining":[2],"byPercent":[2],"bySharedCount":[2]},"OK":{"byHearts":[15],"byLaunched":[15],"byRaised":[15],"byDonations":[15],"byGoal":[15],"byRemaining":[15],"byPercent":[15],"bySharedCount":[15]},"OR":{"byHearts":[24,10,13,19],"byLaunched":[13,19,24,10],"byRaised":[10,13,24,19],"byDonations":[24,10,13,19],"byGoal":[10,13,19,24],"byRemaining":[24,10,13,19],"byPercent":[24,10,13,19],"bySharedCount":[10,24,13,19]},"PA":{"byHearts":[29],"byLaunched":[29],"byRaised":[29],"byDonations":[29],"byGoal":[29],"byRemaining":[29],"byPercent":[29],"bySharedCount":[29]},"VA":{"byHearts":[33],"byLaunched":[33],"byRaised":[33],"byDonations":[33],"byGoal":[33],"byRemaining":[33],"byPercent":[33],"bySharedCount":[33]},"all":{"byHearts":[29,2,7,34,0,4,24,18,16,10,25,17,15,11,13,5,14,35,26,28,19,36,32,23,33,9,30,3,22,37,12,1,21,27,31,6,38,20,8],"byLaunched":[17,8,26,3,12,22,37,5,31,35,13,19,24,14,34,28,10,32,1,6,7,21,11,27,33,0,9,23,15,36,2,29,16,4,25,38,30,20,18],"byRaised":[29,7,16,2,4,18,10,0,34,13,24,15,25,11,35,14,19,17,5,30,26,28,33,32,23,9,37,36,3,12,1,22,38,21,31,27,6,20,8],"byDonations":[29,2,7,34,0,24,4,16,18,10,25,17,15,11,13,5,14,35,26,28,19,36,32,23,33,9,30,3,22,37,12,1,21,27,31,6,38,20,8],"byGoal":[7,0,10,13,19,25,2,14,15,16,18,24,28,34,11,32,5,17,26,35,30,29,12,3,21,33,37,23,9,1,22,31,38,6,4,20,27,36,8],"byRemaining":[36,4,27,23,9,1,22,33,29,37,6,30,35,17,5,16,2,18,3,34,11,26,24,15,10,0,7,14,13,25,28,19,12,38,32,31,20,21,8],"byPercent":[29,4,36,16,2,18,33,23,34,9,35,30,17,1,5,27,11,24,22,37,7,15,10,26,0,3,6,14,13,38,12,20,31,28,25,32,19,21,8],"bySharedCount":[29,16,10,18,34,4,35,9,11,24,13,0,1,30,28,7,15,25,5,17,33,38,37,23,2,3,26,14,19,32,20,27,36,31,12,21,22,6,8]}}}