{"campaigns":[{"source":"gfm","image":"https://images.gofundme.com/nK2K6LpRDqchKnCEq9nbcS3Twlg=/640x480/https://d2g8igdw686xgo.cloudfront.net/48397592_1590787150859815_r.jpeg","hearts":3251,"launched":"2020-05-29T16:50:41-05:00","current":137170,"deactivated":false,"donations":3248,"donations_enabled":true,"goal":100000,"name":"Rebuilding Bole Ethiopian Cuisine","id":"rebuilding-bole-ethiopian-cuisine","longDesc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  As we silently watched our beloved Bolé went up in flames, it was heartbreaking to witness, what we all considered our home, reduced to ashes. What is positive? It is witnessing the overwhelming messages and well wishes that Solomon, Rekik, and the Bolé staff have received.  And we thank you, on behalf of the entire family for standing with us when everything else seems like it has fallen beneath our feet. It is comforting to know that we are not alone in thinking that Bolé was not just a restaurant for us, Bolé was the pillar of the community. Bolé was our home away from home. Because your feedback to this unspeakable misfortune is to rise up, to rebuild, and to become the Bolé you all are accustomed to. And with your unyielding support, we are confident will have you dining at your clean tables in no time. As you might have also known, the irreplaceable damage was not only caused to Bolé restaur","desc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  As we","region":"MN","shared_count":6028,"campaign_state":"active","user":"Lelna Desta","index":0},{"source":"gfm","image":"https://images.gofundme.com/0fD-4yhQev-Nuz9fQnODpo30EfE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48345040_1590602439903874_r.jpeg","hearts":393076,"launched":"2020-05-27T13:28:33-05:00","current":10277500,"deactivated":false,"donations":399064,"donations_enabled":true,"goal":1500000,"name":"Official George Floyd Memorial Fund","id":"georgefloyd","longDesc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear brother, George. My family and I watched in absolute horror as the now infamous and horrifying video began to spread quickly throughout social media. What we saw on that tape left us shell shocked; a white Minneapolis police officer kneeling directly on my brother's neck, obstructing his ability to breathe. As some officers knelt on his neck, other officers participated and watched; no one took any action to save my brother's life.  Those officers would continue to brutalize my brother until he died. This fund is established to cover funeral and burial expenses, mental and grief counseling, lodging and travel for all court proceedings, and to assist our family in the days to come as we continue to seek justice for George.  A portion of these funds will also go to the Estate of George Floyd for the benefit and care of his children and their educational fund. Anyone wishing to send cards, letters of encourag","desc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear b","region":"MN","shared_count":243463,"campaign_state":"active","user":"Philonise Floyd","index":1},{"source":"gfm","image":"https://images.gofundme.com/YzQh1XepzFdf9pX6yjv3U8x_Ns4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48424366_1590898497504932_r.jpeg","hearts":452,"launched":"2020-05-30T23:17:02-05:00","current":27545,"deactivated":false,"donations":452,"donations_enabled":true,"goal":15000,"name":"Restore JapanLA","id":"restore-japanla","longDesc":"JapanLA  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide that live and breathe cute culture. During the evening of May 30th, JapanLA was LOOTED and VANDALIZED by rioters following the protest march throughout Los Angeles. Our hearts, like many of you, are broken seeing the footage that was broadcast on television. Through this GoFundMe, we hope to help our friend Jamie to rebuild this storefront to once again shine on Melrose Ave. JapanLA holds a special place in our hearts and the hearts of many others around the world. Now is the time for us to come together and help JapanLA rebuild their beautiful store that they have worked so hard to make a safe and fun space for us all. These donations will help cover the major cosmetic damages and loss of merchandise in addition to help from the effects of COVID-19. Let's show up for them the way they have for us for over 10 years. If you have the means to make a donation, anything helps. If not, ","desc":"JapanLA  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide t","region":"CA","shared_count":3054,"campaign_state":"active","user":"Jon Brence","index":2},{"source":"gfm","image":"https://images.gofundme.com/HcbNeVmjT27vKVyOwo3HE91S14Y=/640x480/https://d2g8igdw686xgo.cloudfront.net/48414400_1590861863374779_r.jpeg","hearts":105,"launched":"2020-05-30T13:10:34-05:00","current":6740,"deactivated":false,"donations":103,"donations_enabled":true,"goal":10000,"name":"Lynn Nguyen and Brent Collier riot relief","id":"lynn-nguyen-and-brent-collier-riot-relief","longDesc":"My dear friends and neighbors Brent Collier and Lynn Nguyen lost all of their inventory last night in the Portland Rioting. Their store was vandalized and looted.Rent is due and they now have no inventory . They had reinvented themselves and were making Face Masks ,All of them were stolen last night. Any donations would help to begin to replace that inventory. We are all struggling now so if you can help please do .If you help can't please just pray .We all need love ,care and prayer right now.","desc":"My dear friends and neighbors Brent Collier and Lynn Nguyen lost all of th","region":"OR","shared_count":391,"campaign_state":"active","user":"Kathleen Boniface","index":3},{"source":"gfm","image":"https://images.gofundme.com/zyzU8GtO-0T9qkffXeo8hS2dJEE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48423410_1590894509718230_r.jpeg","hearts":124,"launched":"2020-05-30T22:38:35-05:00","current":3714,"deactivated":false,"donations":124,"donations_enabled":true,"goal":5000,"name":"Help Repair Buranko Cafe","id":"help-buranko-cafe","longDesc":"Buranko Cafe is a local POC owned Asian fusion restaurant that was broken into, vandalized, and robbed in the midst of the May riots in downtown Portland.  Run and owned by the family behind Phat Cart Cafe in SW Portland, Buranko has been a long term passion project for them. A ton of time, effort, and personal costs went into opening just earlier this year before being  temporarily shut down by COVID-19.The damages occurred during preparations to re-open on June 12th and have been a major setback in family income, in addition to supporting long time employees. Windows have been  broken, all delivery app tablets, and much of the restaurant's liquor stock have been stolen, adding up to around $5000 in expenses. They need your help, whether by donating funds, sharing this campaign, or supporting the still operating Phat Cart Cafe.  Please consider supporting local, and POC owned businesses during this crisis. Thank you!","desc":"Buranko Cafe is a local POC owned Asian fusion restaurant that was broken into, vandalized, and","region":"OR","shared_count":81,"campaign_state":"active","user":"Carter  Bryan","index":4},{"source":"gfm","image":"https://images.gofundme.com/jId-CxQ2sSlVruUCqpyUPnq-3u8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48412692_1590855681359957_r.jpeg","hearts":226,"launched":"2020-05-30T11:36:59-05:00","current":5365,"deactivated":false,"donations":226,"donations_enabled":true,"goal":5000,"name":"Help small POC owned business recover from riot","id":"help-poc-owned-business-recover-from-riot","longDesc":"\nDuring the riots our small local POC owned business got vandalized and looted . They took about 5,000 worth of supplies , they took our cash registers broke windows ,and the damages created are going to take Us an incredible amount of time to recover from . We have put EVERYTHING into this business and we are devastated . We spent all night outside waiting for police or authorities to arrive and they never showed up ! Clearly it’s a situation that we are going to have to recover from alone but we greatly appreciate any help we can get ! \n\n\nplease spread the word and help a small   Local POC owned business recover from the distraction caused on may 29 2020 . A day we will never forget in Portland Oregon \n","desc":"\nDuring the riots our small local POC owned business got vandalized and","region":"OR","shared_count":463,"campaign_state":"active","user":"Arely Gonzalez","index":5},{"source":"gfm","image":"https://images.gofundme.com/uEAO8ckiKWR6Hbf2ormmwvQSLVU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431340_1590937399616239_r.jpeg","hearts":1522,"launched":"2020-05-31T10:10:54-05:00","current":124885,"deactivated":false,"donations":1531,"donations_enabled":true,"goal":50000,"name":"La Mesa Business Disaster Recovery","id":"la-mesa-business-disaster-recovery","longDesc":"Rebuild La Mesa - Donate to help small businesses affected by the riots last night. The East County Chamber of Commerce Foundation is establishing a relief effort to help the small businesses that were destroyed in the riots on the night of Saturday, May 30 2020.Our small businesses are devastated and many were already on the brink due to COVID19. La Mesa Village has been the heart of small business in the city and is a beautiful place for dining, events and memories.All proceeds will go directly to small businesses that were destroyed or damaged. The Chamber Foundation is a non-profit organization that has been helping East County for over 26 years.","desc":"Rebuild La Mesa - Donate to help small businesses affected by the riots last night. The ","region":"CA","shared_count":8796,"campaign_state":"active","user":"Phil Ortiz","index":6},{"source":"gfm","image":"https://images.gofundme.com/uiTd1Pz3vXUgP2co0McUV-11rXo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48457258_1591029069245794_r.jpeg","hearts":6228,"launched":"2020-06-01T11:34:41-05:00","current":113112,"deactivated":false,"donations":6233,"donations_enabled":true,"goal":100000,"name":"Zahalea Anderson","id":"zahalea-anderson","longDesc":"Zahalea Anderson/ Zahalea Showe lost her business in Long Beach, California yesterday. 25 years in this building running her School of Self Defense, and now it’s been lost to the only fire in Long Beach. It is easy to say “Black Lives Matter,” but if we do not rally behind our black brothers and sisters in times of need then our words are EMPTY. 100% of this fundraiser will be going directly to Zahalea Anderson/Showe to rebuild and reopen her business. I’m in contact with Zahalea and she is the sole beneficiary of the funds raised by this campaign. ","desc":"Zahalea Anderson/ Zahalea Showe lost her business in Long Beach, California yesterday. 25 years in this b","region":"CA","shared_count":1500,"campaign_state":"active","user":"Marie Hosep","index":7},{"source":"gfm","image":"https://images.gofundme.com/fRo6AzSI0rU5stsvQXP4rrZ6iYc=/640x480/https://d2g8igdw686xgo.cloudfront.net/48459544_1591034375384458_r.jpeg","hearts":928,"launched":"2020-06-01T13:05:06-05:00","current":18874,"deactivated":false,"donations":930,"donations_enabled":true,"goal":25000,"name":"FUNDS FOR DESTROYED BLACK OWNED BUSINESS","id":"protesters-and-bond-funds","longDesc":"Hi I am Meriyah Smith from Atlanta Georgia We are working with Current members from Black Lives Matter In the Atlanta ,New York, and  Dallas are to help individuals putting there life on the line everyday . These funds will be withdrawn  to member Alec Bailey because he is  a current individual who is in contact with all the  members from different areas and he will distribute to those three areas to help our fellow African Americans who has lost there businesses due to city riots and also our protestors who are getting arrested. Some of our African Americans spent there whole life to make it out and we out hurting our own kind. #blacklivesmatter","desc":"Hi I am Meriyah Smith from Atlanta Georgia We are working with Current members ","region":"GA","shared_count":706,"campaign_state":"active","user":"Meriyah Smith","index":8},{"source":"gfm","image":"https://images.gofundme.com/gCKmqLn8Y9eHoWDpNBNHfjo8G-A=/640x480/https://d2g8igdw686xgo.cloudfront.net/48462156_1591040330568538_r.jpeg","hearts":13041,"launched":"2020-06-01T15:00:39-05:00","current":300662,"deactivated":false,"donations":13101,"donations_enabled":true,"goal":500000,"name":"Justice for David McAtee","id":"justicefordavidmcatee","longDesc":"This is David McAtee. Also known as “Yaya” &amp; the “BBQ man”.David McAtee was killed this morning in Louisville, Kentucky. He was a black restaurant owner in the community who was fatally shot by authorities around midnight on June 1st. As of 10:45 AM, his body was still lying in the streets. The National Guard had been deployed in Kentucky surrounding the protests, yet McAtee's death occurred at 26th and Broadway.... far far away from any of the protesting.  Kentucky Governor Andy Beshear had called on law enforcement to release the body cam footage of the shooting... but of course, their body cams were turned OFF. We should be absolutely horrified by this man's death and also by the fact that his body was left in the street for 12 hours after the shooting. There is no goal to reach and there is no dollar amount that will ever equal David's life, so this campaign will do everything in its power to secure as many relief funds as possible for the McAtee family. His mother also lost a ","desc":"This is David McAtee. Also known as “Yaya” &amp; the “BBQ man”.David McAtee was killed this mornin","region":"KY","shared_count":5089,"campaign_state":"active","user":"Aida Osman","index":9},{"source":"gfm","image":"https://images.gofundme.com/c8q0Mizg3iVfO2tCsEO_QfHrrBk=/640x480/https://d2g8igdw686xgo.cloudfront.net/48390046_1590978499660650_r.jpeg","hearts":1111,"launched":"2020-05-29T10:38:04-05:00","current":48185,"deactivated":false,"donations":1108,"donations_enabled":true,"goal":40000,"name":"HELP MINNEAPOLIS SMALL BUSINESSES!","id":"help-minneapolis-small-businesses","longDesc":"My name is Rob Smith. I am a verified public figure.Like many of you, I feel completely helpless when I see the destruction happening in Minneapolis right now. No matter what your politics are, many small businesses are being destroyed right now, and they were already struggling due to the closures caused by COVID-19.The only thing I can think to do is to use my platform to help benefit these people in any way I can. I give you my word that I will ensure that EVERY PENNY raised here goes to help these small business owners in some way. The funds will be used to rebuild, pay employees, or, for some, to perhaps restart entirely new businesses. Nobody deserves to have their livelihood destroyed.The world needs some love right now, and these people didn't ask for this, nor do any of them deserve to have their lives destroyed.Please help, spread this around, and I'm counting on the big names who will see this to help guide EVERY CENT raised to where it needs to be.Thank you.","desc":"My name is Rob Smith. I am a verified public figure.Like many of you, I feel completely h","region":"MN","shared_count":7641,"campaign_state":"active","user":"Rob Smith","index":10},{"source":"gfm","image":"https://images.gofundme.com/vGf8uVbQRZ4KrASf7EWuHzZJmZ4=/640x480/https://i.ytimg.com/vi/f4WDjxCP1Fs/0.jpg","hearts":371,"launched":"2020-05-30T20:55:15-05:00","current":16296,"deactivated":false,"donations":371,"donations_enabled":true,"goal":10000,"name":"Essentials and Delivery for Stephanie Wilford","id":"neighbors4stephanie","longDesc":"On Saturday, May 30, Ben Henry of KSTP did a powerful interview with Minneapolis resident Stephanie  Wilford regarding the destruction of local businesses due to ongoing riots following the death of George Floyd.  In the interview, Stephanie indicated the only stores she can shop at were destroyed and she has no access to public transportation because of closures.Her powerful words struck the hearts of many neighbors near and far on social media who want to help.  I am Jill, a fellow Minneapolis neighbor.  Her story brought me to tears and I wanted to do something to help. After encouragement on social media through Twitter - I reached out to Stephanie for approval to establish this Go Fund Me. This is an opportunity to provide relief through donations to Stephanie to help get essentials/transportation to shop (perhaps Shipt or Amazon subscriptions). The response and willingness to help Stephanie financially as well as in person has been overwhelming. Another neighbor, Ann, and myself ","desc":"On Saturday, May 30, Ben Henry of KSTP did a powerful interview with Minneapol","region":"MN","shared_count":571,"campaign_state":"active","user":"Jill Sims","index":11},{"source":"gfm","image":"https://images.gofundme.com/QfFu7PkPun-SpteiPssGH7oMOzA=/640x480/https://d2g8igdw686xgo.cloudfront.net/48464384_1591045590851621_r.jpeg","hearts":119,"launched":"2020-06-01T16:48:57-05:00","current":3089,"deactivated":false,"donations":120,"donations_enabled":true,"goal":10000,"name":"iNails & Spa Long Beach","id":"inails-amp-spa-long-beach","longDesc":"iNails &amp; Spa is a small business in Long Beach that has been destroyed by looters. Many of the stolen/damaged items include TVs, gel machines, the fountain, supplies (like nail polish), and even the religious statues. The owner of iNails &amp; Spa took all her life savings to open this nail shop. These ladies work so hard to survive. I've seen my mother Tina work 12-hour shifts and skipping meals. They don't deserve any of this. These women struggled enough as refugees, with losing their jobs through the pandemic, and now having their workplace destroyed. I am so heartbroken seeing these women cry as they visited the shop this morning. I truly want to thank anyone that has reached out and supported during this hard time. Any support, no matter how small, will be appreciated. The funds donated will go directly to the owner to help her rebuild the shop and fund for supplies. ","desc":"iNails &amp; Spa is a small business in Long Beach that has been destroyed by looters. Many of th","region":"CA","shared_count":129,"campaign_state":"active","user":"Kathy Nguyen","index":12},{"source":"gfm","image":"https://images.gofundme.com/twBm3RUYxMcJY-mss5oIzSvJalo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48441600_159096816183993_r.jpeg","hearts":6,"launched":"2020-05-31T22:59:41-05:00","current":270,"deactivated":false,"donations":6,"donations_enabled":true,"goal":30000,"name":"Philadelphia Black Owned Business Relief","id":"philadelphia-black-owned-business-relief","longDesc":"This fundraiser is for Philadelphia Owned Black Business Owners affected by the protests, riots, and looting. You must be a verified Philadelphia Black Business owner to receive support. Please donate whatever you can donate! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We begin supporting and rebuilding our community by having one another during these times. Our goal is to support the city of Brotherly Love, however other cities are in consideration so if you know any businesses in other cities please let us know and donate!","desc":"This fundraiser is for Philadelphia Owned Black Business Owne","region":"PA","shared_count":0,"campaign_state":"active","user":"Philadelphia Black Owned Business Relief","index":13},{"source":"gfm","image":"https://images.gofundme.com/r5N5GSWiGm3Tp5o-DqDQsoKfYt4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48449080_159099526140131_r.jpeg","hearts":105,"launched":"2020-06-01T02:20:29-05:00","current":2397,"deactivated":false,"donations":105,"donations_enabled":true,"goal":10000,"name":"Help SB Small Businesses Rebuild & Recover","id":"help-sb-small-businesses-rebuild-amp-recover","longDesc":"As someone born and raised in SB, I have so much love for this city. This city raised me and made me who I am. I know I speak for so many who live here that feel angered/disappointed at the direction that today’s protests took. I fully understand and support the need and the anger behind protests in support of the #blacklivesmatter movement and against police brutality. But I could never support looting against small, family owned, and home grown businesses. This page is set up in hopes to aid maybe one or two businesses that have been affected by looting. Please support and/or share this page!\n\n\nALSO, if any of you know of any businesses that could be benefited by any of this money raised, please notify me with their info so I can get into contact with them! ❤️\nMy phone number is (909) 553-4515. ","desc":"As someone born and raised in SB, I have so much love for this city. ","region":"CA","shared_count":70,"campaign_state":"active","user":"Esperanza Elizarraraz","index":14},{"source":"gfm","image":"https://images.gofundme.com/H0QFlRhhdPu7DZBDZygWpUtZmRI=/640x480/https://d2g8igdw686xgo.cloudfront.net/48427110_1590915149164076_r.jpeg","hearts":6449,"launched":"2020-05-31T03:55:25-05:00","current":168864,"deactivated":false,"donations":6472,"donations_enabled":true,"goal":175000,"name":"For James Scurlock’s Family","id":"for-james-scurlocks-family","longDesc":"\n\n\n\n\nWe are creating this fundraiser for James Scurlock and his family. \n\n\n\n\n\n\n\n\n\n\nWho is James Scurlock?A 22 years old young black man who showed his dedication a love for his people every single day. \n\n\n\n\n\n\n\n\n\n\nJames was passionate for Justice, but today his fight ended as he was shot and killed downtown Omaha while protesting for the same Justice he deserves. \n\n\n\n\n\n\n\n\n\n\nMay you Rest In Peace James. \n\n Commonly asked Questions from GoFundMe and everybody else:\n\n Who are you?: I am Aimlys Esso, a member of the community of Omaha, Nebraska. \n\n What is your relationship with James Family or James?: I did not personally know James nor his family. \n\n Withdrawal plan to get funds to the beneficiaries: James Scurlock Sr.  has been set as the SOLE beneficiary of this fund. EVERY SINGLE LAST PENNY OF THIS FUND WILL BE GIVEN TO JAMES’ FAMILY. \n\n How will the funds be spent?: That is not for me to decide. This will be decided by James Family. \n\n I started this fundraiser thinking of how I could","desc":"\n\n\n\n\nWe are creating this fundraiser for James Scurlock and his family. \n\n\n\n\n\n\n\n\n\n\nWho is Jame","region":"NE","shared_count":20888,"campaign_state":"active","user":"Aimlys Esso","index":15},{"source":"gfm","image":"https://images.gofundme.com/qGfe_3PH9BH0vDWrn3jpgdjIVk8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431224_1590937286160752_r.jpeg","hearts":64,"launched":"2020-05-31T10:05:32-05:00","current":2493,"deactivated":false,"donations":67,"donations_enabled":true,"goal":3000,"name":"Fundraiser for small business destroyed","id":"fundraiser-for-small-business-destroyed","longDesc":"\nI’m raising money for a small business that was looted and destroyed last night. Tee is such a nice guy and didn’t deserve for his store to get ransacked. This is a black owned small business. We shouldn’t be tearing down what we are standing for.Stand by one another. \n\n\nAll proceeds will go to tee to help rebuild what was taken from him. \n","desc":"\nI’m raising money for a small business that was looted and destroyed","region":"NY","shared_count":572,"campaign_state":"active","user":"Billie Jean Starkweather","index":16},{"source":"gfm","image":"https://images.gofundme.com/DByhsyWEdV_vb8NbNZT2E_i-Bug=/640x480/https://d2g8igdw686xgo.cloudfront.net/48454474_159104563120260_r.jpg","hearts":122,"launched":"2020-06-01T09:39:26-05:00","current":4112,"deactivated":false,"donations":128,"donations_enabled":true,"goal":200000,"name":"EXPRESS FOOD MARKET RELIEF","id":"express-food-market-relief","longDesc":"My father needed one more year to pay off for this store and now it is all totaled. All merchandise was stolen, the lottery machine was stolen and all the money in the register was stolen. The looters also made a hole in the wall to get to the back of the store to find even more merchandise. My father and my brothers who were employed there are now unemployed.There is an estimated 400k loss. \nWe are completely devastated because this store was our only source of income.\nI am asking that people donate what they can to help my family get back on our feet. \nAnything is much appreciated. \n\nWe need to protect and support small businesses owned by people of color. \n\nIf you have any questions, you can text me at (312) 792-4360\n\nThank you.","desc":"My father needed one more year to pay off for this store and now it is all totaled. All merc","region":"IL","shared_count":137,"campaign_state":"active","user":"Asalh S Ghasim","index":17},{"source":"gfm","image":"https://images.gofundme.com/gG9MqkJSW4cK-qiokcO-CtKAy_I=/640x480/https://d2g8igdw686xgo.cloudfront.net/48426462_1590910107826101_r.jpeg","hearts":1584,"launched":"2020-05-31T02:30:36-05:00","current":72648,"deactivated":false,"donations":1650,"donations_enabled":true,"goal":100000,"name":"Bay Area Black Owned Business Relief Fund","id":"bay-area-black-owned-business-relief-fund","longDesc":"\nHello, my name is Ashley and I’m from Oakland. I’m working with Monica, Tim, Samatha, Erika and Steve to raise money for Black Owned Businesses around the Bay Area.\n\n\nThis fundraiser is for Bay Area Owned Black Business Owners affected by the protests, riots, and looting. You must be a verified Bay Area Black Business owner to receive support. Please donate whatever you can donate! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We begin supporting and rebuilding our community by helping one another during these times. Our goal is to support Bay Area, however other cities are in consideration so if you know any businesses in other cities please let us know and donate! Thank you.\n\n\nOur plan is to disperse the money earned to 10 business owners chosen by the people of our community. Please feel free to leave a comment of a business you know of that’s in need and we will continue to post updates. To ensure that these","desc":"\nHello, my name is Ashley and I’m from Oakland. I’m working with Monica, Tim","region":"CA","shared_count":581,"campaign_state":"active","user":"BAY AREA RELIEF","index":18},{"source":"gfm","image":"https://images.gofundme.com/FB-mAdy5sXLScgSn9Mku0pmijMo=/640x480/https://d2g8igdw686xgo.cloudfront.net/48436488_1590953687546704_r.jpeg","hearts":695,"launched":"2020-05-31T14:51:29-05:00","current":37621,"deactivated":false,"donations":697,"donations_enabled":true,"goal":80000,"name":"Help Black Owned Businesses rebuild","id":"help-black-owned-businesses-rebuild","longDesc":"After the events of the Downtown Oakland Riot, many Black Owned Businesses were vandalized by white influencers, undercover police officers, and members of the violent protest. This leaves these businesses having to come up with the money to pay for the things that they did not destroy. Some business can barely stay afloat right now with the pandemic going on and thus this expense could potentially shut down the store fronts of these businesses they built from the ground up. To preserve and restore these business, we are asking for any sort of monetary donation you can spare. This fund will go towards replacing broken windows, destruction of personal property in and outside of the establishments, and installation/equipment expenses.  Please share with everyone that you know and get this to exceed it's goal. Also feel free to leave the names of businesses that have been personally impacted so that we can reach out to them!","desc":"After the events of the Downtown Oakland Riot, many Black Owned Businesses were vandaliz","region":"CA","shared_count":273,"campaign_state":"active","user":"Jada Ross","index":19},{"source":"gfm","image":"https://images.gofundme.com/Qb7tatBrX2SwNp8akk98MiJlT2Y=/640x480/https://d2g8igdw686xgo.cloudfront.net/48391624_1590771096627363_r.jpeg","hearts":1077,"launched":"2020-05-29T11:56:53-05:00","current":68810,"deactivated":false,"donations":1070,"donations_enabled":true,"goal":100000,"name":"Lloyd's Pharmacy Rebuilding Fund - St. Paul Riots","id":"lloyd039s-pharmacy-rebuilding-fund-st-paul-riots","longDesc":"The first drug store in Hamline, Minnesota opened in 1918 as Florian's Pharmacy. Although the name changed in 1949 to Lloyd's Pharmacy, this independent locally owned and operated pharmacy has been a staple in the St. Paul community for over 100 years. Sadly, due to rioters in the area, the store was looted and destroyed by fire in the early morning on May 29th. To help the owners rebuild, and continue to take care of the patients in the community, we are raising funds for this great community icon to help them as much as they've helped the community over the years.Any donations are appreciated and will go back to rebuilding the pharmacy so that it can keep supporting the community.LIVE LOVE LLOYD'S!!!Update - We have been overwhelmed by the support from our community and abroad!  We can't put in to words how much it means to Lloyd's Pharmacy!  Thank you!!!","desc":"The first drug store in Hamline, Minnesota opened in 1918 as Flori","region":"MN","shared_count":10747,"campaign_state":"active","user":"Philip Hommerding","index":20},{"source":"gfm","image":"https://images.gofundme.com/Z0_1Q6WpU-p2DOXPOkmjWw1703k=/640x480/https://d2g8igdw686xgo.cloudfront.net/48366792_1590686367219182_r.jpeg","hearts":1058,"launched":"2020-05-29T12:39:36-05:00","current":40491,"deactivated":false,"donations":1065,"donations_enabled":true,"goal":60000,"name":"Destruction of Family Run Business During Riots","id":"vandilization-of-family-run-business-during-riots","longDesc":"My name is Javier Tamay, and I am a Junior at Great River School in St. Paul. I am trying to raise money for my uncle's (Jose Tamay) business - El Sabor Chuchi . Last night during the Lake Street riots following the murder of George Floyd, his business was vandalized, and three large store windows were shattered and his store was looted. This isn’t the first time that Jose’s business has been broken into, his store was robbed and looted just a few weeks ago while shut down due to COVID-19. See news story below:News Story Also, last year in June, Jose hired someone to install a new exhaust hood in his restaurant location, but the man who was to install it, disappeared. Jose lost $15,000 cash. Jose sued, he won the court case, but almost a year has passed and he hasn’t received any money.Jose is a really hard working man who works 7 days a week, 13 hours a day, from 8am to 9pm. He does everything he can to provide for his wife and two kids. Being an immigrant, Jose doesn’t have access to","desc":"My name is Javier Tamay, and I am a Junior at Great River School in St. P","region":"MN","shared_count":1621,"campaign_state":"active","user":"Javier Tamay","index":21},{"source":"gfm","image":"https://images.gofundme.com/tpPB3tieEmzt1-dHA0W4l4FRAOI=/640x480/https://d2g8igdw686xgo.cloudfront.net/48379414_1590714964196284_r.jpeg","hearts":907,"launched":"2020-05-28T20:30:42-05:00","current":43720,"deactivated":false,"donations":909,"donations_enabled":true,"goal":50000,"name":"Demolished Small Business in Minneapolis Riot","id":"demolished-small-business-in-minneapolis-riot","longDesc":"Imagine leaving your life of 50 years behind to move to a country for its freedom and opportunity to make a better life, then overnight, you lose everything. A business you built with the little savings that you had, and out of nowhere, everything is shattered with no one to help.These lovely human beings are my parents. They left everything behind to make a better life for their children (me and my brothers). Their small used car shop was destroyed on May 27th, 2020, in the Minneapolis riot that took place for George Floyd. A man who was brutally murdered by the Police, an act of injustice and racism.I'm asking you for half of what is needed to help rebuild my parents' business back up. Everything helps. Please consider donating, even if it's $1, and share with your social group. I will be uploading a video explaining everything that has happened. And I will provide updates weekly.13 cars were stolen from the shop, and everything that's been left behind has been severely damaged. Wind","desc":"Imagine leaving your life of 50 years behind to move to a country for","region":"MN","shared_count":1837,"campaign_state":"active","user":"Kianmehr Ehtiatkar","index":22},{"source":"gfm","image":"https://images.gofundme.com/T7LkHPJUqzuLwE3BjYRS0YGhptQ=/640x480/https://d2g8igdw686xgo.cloudfront.net/48443024_1590993897110285_r.jpeg","hearts":456,"launched":"2020-05-31T19:54:42-05:00","current":43004,"deactivated":false,"donations":463,"donations_enabled":true,"goal":250000,"name":"Help Us Rebuild Sunny Optometry Destroyed by Riots","id":"sunny-optometry-santa-monica-destroyed-by-riots","longDesc":"The team at Sunny Optometry was overwhelmingly excited to welcome back patients after a two month closure from the COVID-19 pandemic. After months of grueling planning, we managed to safely reopen our doors to serve our community and restore our teams’ lost jobs. On Sunday May 31st, only two weeks after reopening, waves of brazen rioters and looters destroyed all that our team has built since 1985. Previously the office of Dr. Weintraub, we have always endeavored to provide superior eye care and deliver a bespoke experience. Dr. Sun, Dr. Sjolund, and the team have invested countless hours to nurture a unique patient experience, and regretfully must inform all patients that Sunny Optometry must again close until further notice to repair the extensive vandalism. We want the community to know that every member of the Sunny Optometry team is from a minority group. We are Asian, Black, Hispanic, and 90% women operated. We are your neighbors, friends, and family. On the eve of our 1 year ann","desc":"The team at Sunny Optometry was overwhelmingly excited to welcome b","region":"CA","shared_count":4540,"campaign_state":"active","user":"Sunny Optometry","index":23},{"source":"gfm","image":"https://images.gofundme.com/5VJeAXs6DjTxfPqpV0Iq4q-MN6Q=/640x480/https://d2g8igdw686xgo.cloudfront.net/48413772_1590859863729931_r.jpeg","hearts":409,"launched":"2020-05-30T12:36:11-05:00","current":11557,"deactivated":false,"donations":407,"donations_enabled":true,"goal":5000,"name":"Juiced up vapors riot break in.","id":"juiced-up-vapors-riot-break-in","longDesc":"David Nettles is a African American man who has built his business from his garage at home, this is a family owned business, as people in Eugene, OR, last night decided to protest for the justice of George Floyd, while breaking into this innocent black mans shop as this is what he does on a daily basis to support his family and the ones he loves. He is extremely devastated at the actions that happened and took place last night. We are asking for this money to help with the repairs and justice for our family as this is not the first break in that has occurred.","desc":"David Nettles is a African American man who has built his business from his garage at ho","region":"OR","shared_count":2917,"campaign_state":"active","user":"David Nettles","index":24},{"source":"gfm","image":"https://images.gofundme.com/SlTIl-Zcnowwb70zQJb2fBUnbIs=/640x480/https://d2g8igdw686xgo.cloudfront.net/48433164_159094498973697_r.jpeg","hearts":606,"launched":"2020-05-31T12:13:47-05:00","current":20865,"deactivated":false,"donations":605,"donations_enabled":true,"goal":50000,"name":"Riot damages to Waller & Company Jewelers","id":"riot-damages-to-wallers-and-company","longDesc":"This is fundraiser to support a local black business that was deeply affected by the riots/protest against police brutality. Waller &amp; Company has been in the black Richmond community for 120 years. Any donation would be a great help to rebuild and protect his business!","desc":"This is fundraiser to support a local black business that was deeply affecte","region":"VA","shared_count":1369,"campaign_state":"active","user":"Wallers Company","index":25},{"source":"gfm","image":"https://images.gofundme.com/0RAh5p30bMV8GP-5T0-5lWlAv-E=/640x480/https://d2g8igdw686xgo.cloudfront.net/48414634_1590863620246464_r.jpeg","hearts":309,"launched":"2020-05-30T14:47:11-05:00","current":10080,"deactivated":false,"donations":306,"donations_enabled":true,"goal":10000,"name":"Help Rebuild Michael's Soul Kitchen after Riot.","id":"help-rebuild-michael039s-soul-kitchen","longDesc":"Greatings Michael's Soul Kitchen Family!As you have recently learned, Michael's Soul Kitchen was vandalized on Friday May 29th during the aftermath of what started out as a peaceful protest in downtown Indianapolis.Michael's Soul Kitchen has been a proud partner with lo cal churches and community organizations to provide free meals to low income and COVID-19 affected seniors in our inner city and in assisted living facilities around the city. We provided these same meals to any families adversely affected by COVID-19! All this dispite the fact that Michael's Soul Kitchen has been closed for regular operations since late March. Michael's is Black owned and operated family restaurant struggling to remain a proud part of Downtown Indianapolis and an example to not just the black community, but to all; that by faith we can accomplish our dreams. We say \"THANK YOU: to all those who supported Michael's Soul Kitchen through your patronage while we were open and we sincerely appreciate your su","desc":"Greatings Michael's Soul Kitchen Family!As you have recently learned, Mic","region":"IN","shared_count":2825,"campaign_state":"active","user":"Romeo Gerson","index":26},{"source":"gfm","image":"https://images.gofundme.com/INv5-FJByGM__7xBUm1onpgGl58=/640x480/https://d2g8igdw686xgo.cloudfront.net/48431000_159094192588008_r.jpeg","hearts":3513,"launched":"2020-05-31T11:22:34-05:00","current":178083,"deactivated":false,"donations":3540,"donations_enabled":true,"goal":250000,"name":"Du Nord Riot Recovery Fund","id":"minnesota-poc-business-support","longDesc":"On the evening of May 25th, 2020, George Floyd was killed by Minneapolis Police. Thousands of people have come to the street to protest and make their voices heard. Following the beautiful peaceful protests, riots overtook the city and the Lake Street Corridor:a beacon for multiculturalism, black and brown entrepreneurship and the rise of family owned businesses. Much is lost.We have received a tidal wave of love and support from across the nation and many have asked how they can help. Thanks to the support we have received and an impending insurance claim, we feel funds would be better directed to our sister businesses in distress. Therefore, Du Nord is establishing this fund to support black and brown companies affected by the riots. In the coming days we will add to the leadership team to bring in more business owners and community leaders.  We are dedicated to rebuilding Minneapolis in a way that ensures our cultural beacons are restored.- Du Nord Craft Spirits owner, Chris Montana","desc":"On the evening of May 25th, 2020, George Floyd was killed by Minneapolis Police.","region":"MN","shared_count":4581,"campaign_state":"active","user":"Chris and Shanelle Montana","index":27},{"source":"gfm","image":"https://images.gofundme.com/WHbGKo6LOaFLPyefh5Lp3QEZeM8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48435484_1590962409179002_r.jpeg","hearts":609,"launched":"2020-05-31T15:14:09-05:00","current":33597,"deactivated":false,"donations":609,"donations_enabled":true,"goal":75000,"name":"Local Melrose store looted & burned during riots.","id":"local-melrose-store-looted-amp-burned-during-riots","longDesc":"A recently widowed, 81 year old, long time Melrose business owner lost everything he had during the George Floyd protest on May 30, 2020. Rioters broke into the store, looted everything, and set the store on fire causing unrepeatable damage. The store is currently burned to ashes. The store was the only thing he had to keep him going, he has now lost everything that allowed him to survive. His only source of income was the store, unfortunately insurance is not covering the damages caused by the riot. Not only has he lost his only source of income, now he has no way to pay his rent and other expenses the store has allowed him to pay.","desc":"A recently widowed, 81 year old, long time Melrose business owner lost eve","region":"CA","shared_count":1642,"campaign_state":"active","user":"Ebbi Ebbi","index":28},{"source":"gfm","image":"https://images.gofundme.com/CajwVovLw4xNlhwLmyQ6slz7OOw=/640x480/https://d2g8igdw686xgo.cloudfront.net/48364082_1590675056487836_r.jpeg","hearts":370,"launched":"2020-05-28T09:38:55-05:00","current":15451,"deactivated":false,"donations":370,"donations_enabled":true,"goal":20000,"name":"Minneapolis Riots Took Everything","id":"minneapolis-riots-took-everything","longDesc":"I am sure everyone in the world has now heard about or seen the video of a Minneapolis Minnesota man’s life senselessly ended by the overuse of force by a Minneapolis  police officer. We were all disgusted and heartbroken by this event as it played out over social media and news outlets everywhere.  Within hours the citizens of that area took to the streets in protest. A few days later that protest turned into violence, looting, and arson.  Bre Lenton, a Salon Manager was living in the heart of the riots on the second floor of an apartment building.  Beneath her were the shops and stores that we all watched as looters picked them apart.  Early into Thursday morning, the looting turned into arson. These rioters armed with crowbars, first broke into her building attempting to take everything in it. Bre, with her fellow tenants literally fought them off pushing them out of the doorway. Shortly after not being able to gain access to the apartment, and after emptying the stores below the bu","desc":"I am sure everyone in the world has now heard about or seen the video of a Minneapolis","region":"MN","shared_count":2659,"campaign_state":"active","user":"Randy Herreid","index":29},{"source":"gfm","image":"https://images.gofundme.com/1-BcMRRCCrw3nqtO8t7aEMECwu8=/640x480/https://d2g8igdw686xgo.cloudfront.net/48395280_1590787495875169_r.jpeg","hearts":294,"launched":"2020-05-29T16:07:51-05:00","current":12503,"deactivated":false,"donations":293,"donations_enabled":true,"goal":20000,"name":"Family Owned Business Affected by Riots and Covid","id":"family-owned-business-effected-by-riots-and-covid","longDesc":"Emily's Eatery was vandalized, glass smashed, looted/robbed. This family has felt the impact from covid-19 and lost their catering events that are the core of their business including graduations, weddings, funerals, etc.  Their little family restaurant and neighborhood hidden gem, Emily's Eatery, formerly Emily's F &amp; M Cafe  that was owned by her beautiful Aunt Emily and Uncle Elliott, is what was keeping their catering company, and business, afloat. They have a $3000 deductible and are losing an average/roughly $2500 a day not being open. They had jobs for their staff, they have been feeding the shut ins and elderly when the Pandemic and Lockdown happened and they have just made plans to donate meals to front-line workers next week.  And knowing the family, they will most likely find a way to still do it.  This family is ALWAYS THE FIRST FAMILY, TO GIVE TO A CAUSE! They have lost out on 10s of thousands of dollars in business due to Covid-19. And now the Riots affecting Emily's. ","desc":"Emily's Eatery was vandalized, glass smashed, looted/robbed. This","region":"MN","shared_count":881,"campaign_state":"active","user":"Anastacia Lindholm","index":30},{"source":"gfm","image":"https://images.gofundme.com/2Cpsn7obww5A7SvP2NRi2m6bYO4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48397092_1590788789736326_r.jpeg","hearts":351,"launched":"2020-05-29T18:35:08-05:00","current":10525,"deactivated":false,"donations":356,"donations_enabled":true,"goal":20000,"name":"Small Family Business looted in Minneapolis","id":"small-family-business-looted-in-lake-street-riot","longDesc":"Our lake street business was looted and destroyed during the early hours on Thursday, May 28th following the death of George Floyd on Monday, May 25th. Our small immigrant-owned family business is located at 417 E Lake Street #25-26 inside of Lake Plaza/Plaza Mexico and has proudly served the south Minneapolis community for over 10 years. Due to the COVID-19 Pandemic, we had to temporarily close our doors for two months and in doing so we took a big loss in income. Just a week ago, our doors were allowed to open once again, and to prepare for the re-opening of our shop, we took on a significant amount of debt to bring merchandise to fill our shelves.Over $20,000 worth of products and property was stolen or damaged. Our dream is to start over again and to do so, we ask the community to please help us get back on our feet by donating anything you can and sharing this were ever you can. We understand that these are difficult times that we as a community are living through and we are etern","desc":"Our lake street business was looted and destroyed during the early hours ","region":"MN","shared_count":161,"campaign_state":"active","user":"Adrian Gutierrez","index":31},{"source":"gfm","image":"https://images.gofundme.com/HnBwIM0WPVTOxWu6UqwVC_BO60g=/640x480/https://d2g8igdw686xgo.cloudfront.net/48442212_1590972061413697_r.jpeg","hearts":149,"launched":"2020-05-31T19:45:52-05:00","current":7427,"deactivated":false,"donations":150,"donations_enabled":true,"goal":10000,"name":"Help Saucee Sicilian Rebuild After The Riots","id":"help-saucee-sicilian-rebuild-after-the-riots","longDesc":"The Saucee Sicilian is a local family owned food truck that is in the process of building a brick and mortar.  On May 30th their building was vandalized and looted during the peaceful protests that turned into a riot in front of their building. The clean-up effort and cost was thought to be covered by insurance, but since this falls under a 'riot' situation, it is now deemed extenuating circumstances and this family needs our help to cover the cost of clean up, items that were stolen and new windows. Any amount you give adds up. Thank you in advance for your support.  ","desc":"The Saucee Sicilian is a local family owned food truck that is in the process","region":"OK","shared_count":603,"campaign_state":"active","user":"Steve Brown","index":32},{"source":"gfm","image":"https://images.gofundme.com/b4gBzJ4Yl6yuCcfw-3LHcvMVN70=/640x480/https://d2g8igdw686xgo.cloudfront.net/48424532_1590899300815144_r.jpeg","hearts":167,"launched":"2020-05-31T10:54:36-05:00","current":9773,"deactivated":false,"donations":167,"donations_enabled":true,"goal":15000,"name":"Help for Carnicería La Huazteca destroyed by riots","id":"help-for-carniceria-la-huazteca-destroyed-by-riots","longDesc":"\nCarniceria La Huazteca, a locally-owned grocery store on Lake Street, suffered major damage during the riots in Minneapolis in response to the senseless and tragic murder of George Floyd. Owned by Alfredo Zagal and his wife Marcela, Carniceria La Huazteca has served the community for seventeen years.\n\n\nAs we’ve seen since the beginning of the pandemic, grocery workers are essential and have been disproportionately affected by the virus. Alfredo recently recovered from Covid-19 prior to the riots. Grocery workers like Alfredo have literally put their lives on the line to make sure we all have food to eat.On the evening of May 29th, rioters and looters broke into Carniceria La Huazteca, shattered windows, destroyed property, and stole merchandise and computers. Insurance only covers a fraction of the damage, so they desperately need help to rebuild.Despite their loss, they continue to support the peaceful protests and remain hopeful about the future of their small business, as well as o","desc":"\nCarniceria La Huazteca, a locally-owned grocery store on Lake Stre","region":"MN","shared_count":334,"campaign_state":"active","user":"Mackenzie Havey","index":33},{"source":"gfm","image":"https://images.gofundme.com/wbKQqNMCryARvLEhgrEF_uYKPBY=/640x480/https://d2g8igdw686xgo.cloudfront.net/46252622_1584675846241720_r.jpeg","hearts":153,"launched":"2020-03-19T22:26:41-05:00","current":12316,"deactivated":false,"donations":163,"donations_enabled":true,"goal":20000,"name":"West Coast Leather destroyed during riots","id":"help-support-small-businesses-west-coast-leather","longDesc":"\nWhen you create a business, you sign up to deal with the challenges that come along with that. However, most small business owners never imagine those challenges include a national pandemic and mass destruction. Not being open for 2 months was a challenge, then we were presented with riots and looters that destroyed our store, and stole more than half our inventory in the process. People are mad. We are mad. The injustice that is happening to our black community members is not fair. What happened to George Floyd was not fair. \n\n\nHowever, destroying small businesses isn’t the answer. Looting all our inventory isn’t the answer. The acts that have been taking place across the country are criminal and detrimental. When a small business takes a hit like this, it is nearly impossible to rebuild. We need your help. Please donate to our go fund me, and help us rebuild. We must come together as a community. \n\n\n************\n\n\n#SmallBusinessRelief \n\n\n3/20 My Dad, Stanley \"Skip\" Pas, is an amazin","desc":"\nWhen you create a business, you sign up to deal with the challenges that come ","region":"CA","shared_count":1123,"campaign_state":"active","user":"Michelle Pas","index":34},{"source":"gfm","image":"https://images.gofundme.com/ZfpONWBCPh1mIjFBjZNMTSY1kDY=/640x480/https://d2g8igdw686xgo.cloudfront.net/48455742_1591025631729829_r.jpeg","hearts":130,"launched":"2020-06-01T10:35:47-05:00","current":8208,"deactivated":false,"donations":133,"donations_enabled":true,"goal":5000,"name":"Miami Fusion Cafe Riot Recovery","id":"miami-fusion-cafe-riot-recovery","longDesc":"You see this little restaurant right here! It has been part of the Downtown Birmingham scene for some time now. It has been awarded time and time again as one of the top food destinations in the city. This store plus the El Conquistador food truck not only feeds paying repeat dedicated customers but is also a ministry to the homeless and to help those recovering from addictions. During this pandemic the store has been closed, but the food truck has been rolling all over the city to feed first responders and Frontline workers.The owners of this establishment are hard working God fearing people the truly do His work. You have no money for lunch...they will feed you. You have no way to get there...they bring it to you. They each have come from places in their lives from which they had demons to overcome. From ZERO they have built their lives.This is the source for income for this family. They support 4 kids from the income from this restaurant.This restaurant was severely damaged in the r","desc":"You see this little restaurant right here! It has been part of the Downtown Birmingha","region":"AL","shared_count":859,"campaign_state":"active","user":"Amanda Gail Russ","index":35},{"source":"gfm","image":"https://images.gofundme.com/P9sLhtsAEZuuZTp3U1f7sc2VNic=/640x480/https://d2g8igdw686xgo.cloudfront.net/48434572_1590947589313403_r.jpg","hearts":80,"launched":"2020-05-31T13:02:20-05:00","current":3985,"deactivated":false,"donations":81,"donations_enabled":true,"goal":5000,"name":"Rebuilding After The Riots, Giving Back To Rae Ann","id":"20t6qmq8tc","longDesc":"Anyone who knows Rae Ann and family knows they are the most giving and generous people out there. Their livelihood was victimized by the riots and looting from last night.  Without getting into many details, insurance is very “fickle” with certain circumstances.  Rae Ann was the Co-Founder of a group called Helping Essential Workers and played a MAJOR role is feeding close to 7000 local essential workers along with raising the $15000 used to feed these essentials.  Not only did she play a major roll but her stores donated HUNDREDS of dollars to feed the cause!  Now is our turn to give back and support the “supporter”.  There are clean up costs along with rebuild and restock costs, and everything in between! Please consider donating to an amazing family and upstanding business that supports our community in so many ways.","desc":"Anyone who knows Rae Ann and family knows they are the most giving a","region":"NY","shared_count":455,"campaign_state":"active","user":"Nadene Madigan","index":36},{"source":"gfm","image":"https://images.gofundme.com/Bx-8JqKoIvtY4tYr4mMt5hDY4Ug=/640x480/https://d2g8igdw686xgo.cloudfront.net/48444598_1591035841586442_r.jpeg","hearts":65,"launched":"2020-05-31T21:19:53-05:00","current":2615,"deactivated":false,"donations":67,"donations_enabled":true,"goal":10000,"name":"Corbo's Bakery Cleveland Riot Damage Fund","id":"corbo039s-bakery-cleveland-riot-damage","longDesc":"Corbo's was founded by Joe Corbo's grandparents in 1958 on Kinsman and was moved to Mayfield Road in Little Italy in the early 1960s.  Corbo's is truly a family business, as its roster of 40 workers includes 10 members of the Corbo family.As immigrant Italians that started out with nothing, they built their foundation in Little Italy, Cleveland and have become a staple in our community.  On May 31, 2020 violent riots broke out in Cleveland after a peaceful protest mourning the loss of George Floyd.  As a nation, we are all devastated by his tragedy and we pray for peace and comfort of his family.Instead of coming together as a nation in solidarity, people started rioting, vandalizing, and looting stores.  Corbo's Bakery Playhouse Square was in the line of fire and after standing out all day trying to protect their business, people were throwing things at the owners and their family, and after getting hit in the head with red bull cans among other things, they went inside to protect the","desc":"Corbo's was founded by Joe Corbo's grandparents in 1958 on Kinsman and was mov","region":"OH","shared_count":1847,"campaign_state":"active","user":"Catherine Ann","index":37},{"source":"gfm","image":"https://images.gofundme.com/IGl2y_lErqtzGOJenHhMZ1e5lps=/640x480/https://d2g8igdw686xgo.cloudfront.net/48417542_159087210273038_r.jpeg","hearts":80,"launched":"2020-05-30T16:05:22-05:00","current":4464,"deactivated":false,"donations":80,"donations_enabled":true,"goal":10000,"name":"Small Business Destroyed in Atlanta Riots","id":"small-business-destroyed-in-atlanta-riots","longDesc":"Already suffering from three months of business closure due to COVID-19, my dad has been anxious for things to start calming down so he can reopen and make up for all the lost business. He is an immigrant who came to the US to give his family a chance at a better life, and now he lost his business.Late at night on May 29, his store got broken into and looted, causing an even larger setback for him that he cannot recover from on his own. Since he was unable to afford any insurance and has no coverage to fall back on, my only hope is kind people being able to lend a helping hand.Please consider helping out so he can begin repairing his store and replacing merchandise to reopen as quickly as possible to keep the family afloat. No amount is too small; I would appreciate any and all help you could afford to give. Thank you all.Thanks again for your support!Created by Moe's children to lend our dad support.","desc":"Already suffering from three months of business closure due to COVID-19, my ","region":"GA","shared_count":309,"campaign_state":"active","user":"Armaan Esfahani","index":38},{"source":"gfm","image":"https://images.gofundme.com/36OJEn6n47l0fZM3rfahravQz7o=/640x480/https://d2g8igdw686xgo.cloudfront.net/48412170_1591133115327479_r.jpeg","hearts":5235,"launched":"2020-05-30T10:55:16-05:00","current":132543,"deactivated":false,"donations":5263,"donations_enabled":true,"goal":150000,"name":"Atlanta Black Owned Business Relief","id":"atlanta-black-owned-business-relief","longDesc":"This fundraiser is for Atlanta Owned Black Business Owners affected by the protests, riots, and looting. You must be a verified Atlanta Black Business owner to receive support. Please donate whatever you can donate! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We begin supporting and rebuilding our community by having one another during these times. Our goal is to support Atlanta, however other cities are in consideration so if you know any businesses in other cities please let us know and donate!We are currently raising funds to support the following business an initiatives in Atlanta and other various cities. -RCR Consignment-Attom Shop We will be updating this list as we find out more information on other businesses in the Atlanta area that are seeking financial relief. Once funds are given out to the specified businesses, the remaining amount will go to other funds that support our community during this time","desc":"This fundraiser is for Atlanta Owned Black Business Owners aff","region":"GA","shared_count":1013,"campaign_state":"active","user":"Atlanta Black Business Owned Relief","index":39},{"source":"gfm","image":"https://images.gofundme.com/eWir0P981tUQNbsO7mpyeAvERvU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48412620_1590856833739440_r.jpeg","hearts":3743,"launched":"2020-05-30T11:40:44-05:00","current":108829,"deactivated":false,"donations":3752,"donations_enabled":true,"goal":100000,"name":"Rebuild Guns and Roses Boutique","id":"fv47qs-protect-our-community","longDesc":"\nGuns and Roses Boutique has been a staple in Dallas, TX  for over 8 years.  On Friday, May 29, 2020 the boutique was destroyed by selfish looters who took advantage of the protest. The restoration of Guns and Roses Boutique starts NOW!Princess Pope, Owner and Leader has been a prominent pillar in the community, known to give the shirt off her back, she has put blood, sweat and tears into her business. As a fashion industry leader, she provides education and mentorship to aspiring Fashion Designers and Entrepreneurs. Let's get Guns and Roses back open again. All donations will go towards any expenses needed to reopen the boutique that insurance does not cover! We appreciate your support!\n\n\nTHIS IS THE OFFICIAL GO FUND ACCOUNT! Any other support pages are not associated with Guns And Roses Boutique.Update from OrganizerMy name is Cashmere Pope, I reside in the city of Dallas. Princess is my sister. This donation campaign was started to help cover damages to Guns and Roses Boutique. The ","desc":"\nGuns and Roses Boutique has been a staple in Dallas, TX  for over 8 years.  On Friday, ","region":"TX","shared_count":5528,"campaign_state":"active","user":"Cashmere Pope","index":40},{"source":"gfm","image":"https://images.gofundme.com/offhVhmLecgxqcwsPViTFuO97YU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48383462_1590832750364337_r.jpg","hearts":2517,"launched":"2020-05-29T00:37:52-05:00","current":66698,"deactivated":false,"donations":2520,"donations_enabled":true,"goal":75000,"name":"Somali owned businesses affected by rioters","id":"somali-owned-businesses-affected-by-rioters","longDesc":"My name is Mowlid Khadar Jigre. My father is the owner of Jigjiga business center LLC. We own a small business in Minneapolis, MN which was vandalized, looted and robbed. Due to the Minneapolis riots and the death of George Floyd a lot of black Somali owned businesses were affected by the riots. Our goal is to distribute the donations evenly the best we can. Starting with the midtown-Phillips and uptown areas the areas that were hit the hardest.  Some small businesses can’t recover from this. Please find it in your heart to donate what you can.","desc":"My name is Mowlid Khadar Jigre. My father is the owner of Jigjiga business ce","region":"MN","shared_count":545,"campaign_state":"active","user":"Mowlid Jigre","index":41},{"source":"gfm","image":"https://images.gofundme.com/L51dwzq_L7kim2rVbsBZ28XV40Q=/640x480/https://d2g8igdw686xgo.cloudfront.net/48412666_1590856083545084_r.jpeg","hearts":1811,"launched":"2020-05-30T11:36:58-05:00","current":54162,"deactivated":false,"donations":1818,"donations_enabled":true,"goal":100000,"name":"Go Get It Tobacco","id":"z8puys-gogetit","longDesc":"Hello Everyone,We appreciate all of your concern and support. Unfortunately, Go Get It Tobacco was broken into and robbed last night in the midst of the pain and trauma since the death of George Floyd. We are absolutely devastated - both of the death of George Floyd and of the challenge it will be to rebuild. But we know buildings do not matter more than Black Lives. We are a Black-Owned Business supporting local community members, designers, and entrepreneurs across our great state. It’s rare to see a Tobacco owner who is Black, which was why we opened the store. We stand with the movement for Black Lives. We support the community during this challenging time. #The marathon Continue￼If you are able please help us rebuild. Link here","desc":"Hello Everyone,We appreciate all of your concern and support. Unfortunately, Go Get It Tobacco was b","region":"MN","shared_count":607,"campaign_state":"active","user":"GoGetIt GoGetIt","index":42},{"source":"gfm","image":"https://images.gofundme.com/2hUdVSMYDX_dLEbX5z5n4C-6KMw=/640x480/https://d2g8igdw686xgo.cloudfront.net/48415066_1590864189192737_r.jpeg","hearts":6917,"launched":"2020-05-30T14:16:53-05:00","current":214223,"deactivated":false,"donations":6936,"donations_enabled":true,"goal":200000,"name":"Save Mama Safia’s Kitchen","id":"save-mama-safias-kitchen","longDesc":"\nFamily and friends we need your help!Mama Safia opened her doors December 1, 2018 with little but her life savings instead of retiring at the age 66. Her passion for cooking led to her lifelong dream of owning her own restaurant. Mama Safia wanted to bring authentic Somali cuisine to the Longfellow Neighborhood. The restaurant’s motto was “From Our Kitchen To Yours” in which she made all her dishes from scratch. \n\n\nMama Safia understands the anger pulsing throughout Minneapolis. We stand in solitary with George Floyd and his family. She states “I can always rebuild but we will NEVER get George back. My condolences to the Floyd family.”On March 18, Mama Safia closed her doors because of the stay at  home order for her safety and the safety of the community. She used her stimulus check, her husband’s and her daughters‘ to make the rent payment for the restaurant.On May 28, 2020 her dream was destroyed.Please help however you can.  \n\n\nThis is organized by Mama Safia’s daughters\n\n\n \n","desc":"\nFamily and friends we need your help!Mama Safia opened her doors December 1, 2018 with little ","region":"MN","shared_count":4007,"campaign_state":"active","user":"Saida Hassan","index":43},{"source":"gfm","image":"https://images.gofundme.com/0bfLWJopx6LdQFsWKbY7nqsnSeo=/640x480/https://i.ytimg.com/vi/IwTTvBRw5_4/0.jpg","hearts":3124,"launched":"2019-07-16T09:46:35-05:00","current":121106,"deactivated":false,"donations":3298,"donations_enabled":true,"goal":150000,"name":"Help Trio (Black-Owned) Thrive in Minneapolis","id":"helptriothrive","longDesc":"Help Trio Thrive As The First 100% Black Owned Vegan Restaurant In MinneapolisThree years ago, Louis Hunter was facing a whopping twenty years in prison for unjust charges related to his presence at a #BlackLivesMatter protest in the Twin Cities. He was at risk of losing his life, freedom and being taken away from his four daughters, family and beloved community. For two years, Louis continued to proclaim his innocence and fought to get his charges dropped, to no avail. During this traumatic time, Louis lost his car, his lawn care business, and his housing, as a result of his pending charges.Just weeks before his trial, a local couple, Sarah and Dan Woodcock, heard his story and felt compelled to get involved. Sarah and Dan worked with local Black Lives Matter (BLM) leaders, including Nekima Levy Pounds and Chauntyll Allen and allies to rally the community to help fight Louis’ bogus charges. After a concerted effort, all of Louis’s charges were miraculously dismissed. In the aftermath ","desc":"Help Trio Thrive As The First 100% Black Owned Vegan Restaurant In Mi","region":"NE","shared_count":6483,"campaign_state":"active","user":"Catrice M. Jackson","index":44},{"source":"gfm","image":"https://images.gofundme.com/i6DpvlXEAOsgIO3dO0VW8lGlAcM=/640x480/https://d2g8igdw686xgo.cloudfront.net/48420680_159088602017346_r.jpeg","hearts":1321,"launched":"2020-05-30T20:25:43-05:00","current":37576,"deactivated":false,"donations":1327,"donations_enabled":true,"goal":30000,"name":"Black-Owned Business Relief Fund","id":"black-owned-businesses-relief-fund","longDesc":"\n[CLOSED] We have reached our goal! Thank you! We will be donating funds to Black business owners and their designated GoFundMe’s and some direct payments (paypal, venmo,cashapp) to them and providing proof. We ask that you no longer share this campaign, but direct your efforts toward these Bail Funds For Protesters  (link). Thank you!(This campaign is closed but going through a verification process.)This fundraiser is in support of Black Owned Businesses in various cities that have been affected by the recent protests for justice of the murder of George Floyd. Thankfully, this money can help support Black business owners and help them rebuild their businesses. Many Black business owners are mourning with the community, seeking justice for George Floyd and the many other Black lives that have been taken, and having to rebuild their businesses in the midst of it. We will continue to honor the black lives that have been lost.Link To The Organization \n","desc":"\n[CLOSED] We have reached our goal! Thank you! We will be donating funds to Black ","region":"GA","shared_count":199,"campaign_state":"active","user":"Art Hoe Collective","index":45},{"source":"gfm","image":"https://images.gofundme.com/VpdVutdV4Jw01TyjDlE2d062VBU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48434298_1590947244168076_r.jpeg","hearts":1742,"launched":"2020-05-31T12:47:45-05:00","current":63547,"deactivated":false,"donations":1743,"donations_enabled":true,"goal":75000,"name":"Help Private Stock, Looting Victim Austin TX","id":"help-private-stock-looter-victims-austin-tx","longDesc":"Private Stock Premium Boutique is a Black Owned Black Operated clothing boutique on 6th Street in Austin Texas that was looted during the George Floyd police brutality protests in Austin Texas on May 30th. Private Stock’s windows were smashed and people looted almost all of their property within minutes. They were just starting to recover from the coronavirus pandemic, when their business was destroyed by looters. This is a small business, locally owned and operated, and any help to recover from this senseless act of violence is greatly appreciated. Thank you for helping out our friends at Private Stock!!","desc":"Private Stock Premium Boutique is a Black Owned Black Operated clothin","region":"TX","shared_count":5613,"campaign_state":"active","user":"All Saints  Tattoo","index":46},{"source":"gfm","image":"https://images.gofundme.com/TyyDlPW92BAT2alSeNPcwFDNQpU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48430414_1590933511897300_r.jpeg","hearts":1151,"launched":"2020-05-31T09:58:00-05:00","current":35612,"deactivated":false,"donations":1153,"donations_enabled":true,"goal":30000,"name":"Rumors Boutique","id":"rumors-boutique","longDesc":"During the riots last night, Rumors Boutique was damaged along with several other local and minority-owned businesses located on Broad Street. Our windows and door have been smashed and vandalized. It has been an uphill battle trying to survive as a business during COVID 19. After the damage last night, it feels like we are trying to climb that hill with broken limbs and bleeding fingers.Today is Rumors Boutique's 13th anniversary. Rumors Boutique is a minority-owned and operated company since 2007. For the first time in 13 years, we are asking for financial help from our community to help us recover from the damage. We will exist in this community as long as the community wants us here. We will be boarding up our windows for the next few weeks until the threat has passed. Please, protesters, be safe, know that we forgive you, and you are not alone. I stand with you because I am you.","desc":"During the riots last night, Rumors Boutique was damaged along with several other local and minority-owne","region":"VA","shared_count":2541,"campaign_state":"active","user":"Marshe Wyche","index":47},{"source":"gfm","image":"https://images.gofundme.com/cJTBXNll9Q1rJfZfQ50_9iiCHCs=/640x480/https://d2g8igdw686xgo.cloudfront.net/48436804_1590954548657919_r.jpeg","hearts":733,"launched":"2020-05-31T14:53:44-05:00","current":17407,"deactivated":false,"donations":735,"donations_enabled":true,"goal":20000,"name":"Chicago black and brown business relief","id":"small-businesses-affected-in-chicago","longDesc":"This fundraiser is for Chicago black and brown businesses affected by the protests, riots, and looting. You must be a verified Chicago  black/brown business owner to receive support. Please donate whatever you can !! Funds will be used to support and repair any damages that have been done during these protests, riots and looting acts. We can rebuild our communities together. \nSo far the businesses ill be donating to are :\n             \n-Flamingo bar and grill (a brown owned restaurant)\n- Express food market\n- Quesadilla Monarca \n","desc":"This fundraiser is for Chicago black and brown businesses affected by the protest","region":"IL","shared_count":4163,"campaign_state":"active","user":"Aaliyah Lara","index":48},{"source":"gfm","image":"https://images.gofundme.com/E4Yn6020A3-FbB_VFKwb1SGmEtU=/640x480/https://d2g8igdw686xgo.cloudfront.net/48394912_1590796254464496_r.jpeg","hearts":856,"launched":"2020-05-29T14:21:36-05:00","current":26433,"deactivated":false,"donations":859,"donations_enabled":true,"goal":25000,"name":"BLACK BUSINESS MINNESOTA FUNDRAISER","id":"black-business-minnesota-fundraiser","longDesc":"Hello,Hello!Black Business Minnesota is a Facebook group that gives a platform to black owned businesses to showcase their products and to network with their communities.     you can find us here https://www.facebook.com/groups/blackbusinessmn/We held hands to protect other businesses and buildings were elderly reside while our own businesses were being torn downSome of our friends have been injured physically and economically from recent events.There are several black owned businesses that were vandalized or burned down due to recent events.As you know most POC businesses are not ale to bounce back or reopen after this, the majority did not get the PPP protection during COVID-19 and with this recent event they are ready to give up.let's support them, please donate what you can and spread the word!HERE IS A LIST OF SOME OF BLACK OWNED BUSINESSES THAT WERE AFFECTED :Bougies Mn &lt;-Black owned - fire damange, looted, property damage NEWRULESMN.COM - UpdatedNew Rules on Lowry&lt;-Black o","desc":"Hello,Hello!Black Business Minnesota is a Facebook group that gives a platform to bla","region":"MN","shared_count":776,"campaign_state":"active","user":"Nancy Korsah","index":49},{"source":"gfm","image":"https://images.gofundme.com/DVZ0wJTFmLq71zRutwnS7POYy3o=/640x480/https://d2g8igdw686xgo.cloudfront.net/48430406_1590978284734181_r.jpeg","hearts":978,"launched":"2020-05-31T21:58:08-05:00","current":25279,"deactivated":false,"donations":983,"donations_enabled":true,"goal":70000,"name":"Help Rebuild a Minneapolis Mental Health Clinic","id":"healing-path-wellness-services","longDesc":"On Friday May 28th, Healing Path Wellness Services was unfortunately looted and destroyed. The clinic suffered extensive fire and water damage. We are a Black-owned mental health clinic located in the heart of South Minneapolis providing culturally appropriate and accessible mental health and social services. Systemic racism, oppression and poverty affect our mental, emotional, physical and social wellbeing. We not only experienced this firsthand but witnessed its effects within our community. Our top priority is serving marginalized populations, including black immigrants and refugees, they need our support! Our vision is to ensure the community has a safe space to be empowered and receive social services that increase their quality of life.In the wake of George Floyd's murder, our community has experienced devastating and traumatic events. As such, we are on the frontlines providing a space for people to seek therapy and healing during this hard time. We need to remain open to contin","desc":"On Friday May 28th, Healing Path Wellness Services was unfortunately l","region":"MN","shared_count":191,"campaign_state":"active","user":"Sulekha Ibrahim","index":50},{"source":"gfm","image":"https://images.gofundme.com/RrE8-HCcX9zZ3uLXV7TQuXNqukw=/640x480/https://d2g8igdw686xgo.cloudfront.net/48452450_1591021568508748_r.jpeg","hearts":143,"launched":"2020-06-01T08:35:21-05:00","current":3581,"deactivated":false,"donations":144,"donations_enabled":true,"goal":20000,"name":"Rebuilding Imahn’s hair studio ( black owned)","id":"rebuilding-imahns-hair-studio-black-owned","longDesc":"\nThe black community is hurting and we ARE hurting with all of them.  GEORGE FLOYD’SLIFE MATTERED. BLACK LIVES MATTER. we are just tired just like you. Imahn’s hair studio was LOOTED .. VANDALIZED AND DESTROYED on 06/01/2020.  As an African American woman I understand why my people are angry and are tired.  But as black business owner I am bothhurt and angry that my people would vandalize and destroy a black owned business. I feel  both betrayed and HURT. I put my salon in a black neighborhood FOR my people and this is how they repaid me.. FOUR DAYS BEFORE PHILADELPHIA BUSINESSES WERESUPPOSED TO OPEN BACK UP.  It’s bad enough both my stylist and I were forced to close and out of work due to covid-19. It’s bad enough my stylist and I have children in college and have been struggling to support our families for four months. I get why my people are angry and struggling to find ways to express their frustration but I am beyond disappointed in my community. My stylist being out of work for ","desc":"\nThe black community is hurting and we ARE hurting with all of them.  GEO","region":"PA","shared_count":44,"campaign_state":"active","user":"Charise Dorsey","index":51},{"source":"gfm","image":"https://images.gofundme.com/_4e_yosVXobsNfDUVbMMY1IruJ4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48454606_1591026904881451_r.jpeg","hearts":1057,"launched":"2020-06-01T09:39:22-05:00","current":41288,"deactivated":false,"donations":1063,"donations_enabled":true,"goal":20000,"name":"Help Kane's Barbershop and Altatudes","id":"help-kane039s-barbershop","longDesc":"\nKane's Barbershop and Altatudes on East 12th Street caught fire last night, May 31. Both businesses sustained extensive fire, smoke, and water damage.\n\n\nStephen Bass-Kane and Alta Alexander are a small business people. Kane's and Altatudes are a Black-owned business in the historic East 12th Street business district. Kane's and Altatudes are an inclusive places: black, brown, and white are all welcome. They deserves our admiration and support.\n\n\nWe are raising money to help them repair.\n","desc":"\nKane's Barbershop and Altatudes on East 12th Street caught fire last night, May","region":"TX","shared_count":2757,"campaign_state":"active","user":"Phillip Niemeyer","index":52},{"source":"gfm","image":"https://images.gofundme.com/RsCAuh1gQeZlP3o9oV3FiGoR4RQ=/640x480/https://d2g8igdw686xgo.cloudfront.net/48458582_1591031997723973_r.jpeg","hearts":215,"launched":"2020-06-01T13:02:40-05:00","current":4988,"deactivated":false,"donations":216,"donations_enabled":true,"goal":5000,"name":"Helping Black Owned Business in the Bay","id":"helping-black-owned-business-in-the-bay","longDesc":"With the current state that America is in black lives and black-owned businesses are under threat every day more than ever. every protest starts peacefully however not all end peaceful and most of the time small businesses suffer the most. This shop is owned by an immigrant Sudanese family that escaped a ruthless dictatorship in Sudan to set a better life for their kids in America. they have put their heart into this business. I ask that you chip in $1, $5 anything helps. this is how change is made. through helping black-owned businesses. if you can't donate SHARE THIS LINK.  everyone wants to help and this one of the ways you can.#BlackLivesMatter#SupportSmallBlackOwnedBuisnesses#WeAreaAllInThisTogether","desc":"With the current state that America is in black lives and black-owned businesses a","region":"CA","shared_count":201,"campaign_state":"active","user":"Haifa Ahmed","index":53},{"source":"gfm","image":"https://images.gofundme.com/__4IFO8bwtpsRUgEE759by3WCtc=/640x480/https://d2g8igdw686xgo.cloudfront.net/48470108_1591056937769050_r.jpg","hearts":466,"launched":"2020-06-01T19:26:11-05:00","current":11487,"deactivated":false,"donations":467,"donations_enabled":true,"goal":1000,"name":"Please Help Old Fashion Donuts fix Damages","id":"20v3z0sk2o","longDesc":"Old Fashioned Donuts is a 48 year old black owned and operated business located in the Roseland neighborhood of Chicago, IL. \n\nOn Sunday, May 31st our establishment was VANDALIZED despite our efforts to protect it from looters. \n\nIn a community where just about everything was broken into a destroyed, we are one of the only restaurants still standing.\n\nPlease donate to help fix our broken storefront so that we can reopen and feed the people in our community. \n\nAbout the owner(s): Buritt Bulloch is 81 years old and moved to Chicago from Mississippi with dreams to create his own business with his now deceased wife Mamie Bulloch. Mr. Bulloch opened the Donut Shop back in 1972 and we’ve been a staple to the south side of chicago ever since. \n\n","desc":"Old Fashioned Donuts is a 48 year old black owned and operated business locate","region":"IL","shared_count":13331,"campaign_state":"active","user":"Leda Edwards","index":54},{"source":"gfm","image":"https://images.gofundme.com/F_kL8JN76_Fukjd7CzmAlAEsMWA=/640x480/https://d2g8igdw686xgo.cloudfront.net/48444792_15910479423780_r.jpeg","hearts":162,"launched":"2020-06-01T16:48:42-05:00","current":5266,"deactivated":false,"donations":162,"donations_enabled":true,"goal":20000,"name":"Support Emma’s Clothing","id":"support-emmas-clothing","longDesc":"On May 30, 2020, Emma’s Clothing, a black owned business at 896 N Goodman St (Goodman Plaza) was looted and destroyed. My mother Emma has been in business for 20 years and has dedicated her life to serving her customers. She migrated from Haiti as a teenager and has since found her home in the Rochester community that she very much loves. In her 20 years, she has provided essential clothing and accessories items at a price that those poverty stricken in the community can afford. In her beginning days, her business location was simply a folding table in the grass on West Avenue where she sold items out of her van. Her staple items such as her 3 for $10 t shirts and 2 for $25 jeans have been at the same price for years to ensure her long time customers can always afford to shop for their families. She is known for always helping the community and never hesitates to help those around her. Due to falling on hard times during the covid 19 pandemic and before, there was unfortunately no busi","desc":"On May 30, 2020, Emma’s Clothing, a black owned business at 896 N Goodman St (Goodman Plaza) was lo","region":"NY","shared_count":364,"campaign_state":"active","user":"Kayla Ulom","index":55},{"source":"gfm","image":"https://images.gofundme.com/nzvnTW1McoTlcqe7_2QgdUD9iWE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48466180_1591057009137819_r.jpeg","hearts":1220,"launched":"2020-06-01T18:19:39-05:00","current":78162,"deactivated":false,"donations":1223,"donations_enabled":true,"goal":75000,"name":"Please Help Repair Gina's Bargain Thrift","id":"please-help-gina039s-bargain-thrift","longDesc":"Sadly on May 31st our parents' store, Gina's Bargain Thrift, was broken into and looted. This is a small family owned business that my parents Vincent and Gina built from the ground up over 20 years ago. Our parents came from humble beginnings and have spent their adult lives working day and night to grow this black-owned, family-owned, immigrant-owned business. Beyond just providing for our family, they have used this business as a means to give back to the community in numerous ways, from helping to build schools and hospitals in Nigeria to funding the education of countless children. They of all people did not deserve to be the targets of such senseless crime and vandalism.This crime has been devastating and it will take a lot to repair the damage done, especially coming after the store was forced to close for an extended period due to Covid-19. These looters were not affiliated with any protest, they were just taking advantage of a chaotic period in our country and now we are left ","desc":"Sadly on May 31st our parents' store, Gina's Bargain Thrift, was broken into an","region":"CA","shared_count":2420,"campaign_state":"active","user":"Chike Amajoyi","index":56},{"source":"gfm","image":"https://images.gofundme.com/jCiTFyYBZZ1luNFebK0vmGz7sbc=/640x480/https://d2g8igdw686xgo.cloudfront.net/48419884_1590881744460064_r.jpeg","hearts":716,"launched":"2020-05-30T18:51:14-05:00","current":46754,"deactivated":false,"donations":716,"donations_enabled":true,"goal":5000,"name":"Oakland Black Business Damage Fund","id":"oakland-black-business-damage-fund","longDesc":"Oakland Black Business Damage Fund“A riot is the voice of the unheard” - MLKFriends, On May 29,2020 in Oakland,many took to the streets in rage and sorrow to protest the killing of black people by police in America . While we are tired, many of us also hear the calls to action of this moment and want to do what we can to address the injustice experienced by George Floyd, Breonna Taylor, and so many more. As we navigate this time, I encourage everyone to VALUE LIVES FIRST - please prioritize donating to bail out funds, legal defense funds, social justice funds and other organizations continuing the daily fight to end structural racism rooted in white supremacy. A list of priority organizations to donate to is provided below.If you are able to do more, there are other steps we can take to support the long-term economic viability of the black community in our city.  While the majority of black-owned businesses were unharmed during the most recent protests, a few received superficial damag","desc":"Oakland Black Business Damage Fund“A riot is the voice of the unheard” - MLKFriends","region":"CA","shared_count":1266,"campaign_state":"active","user":"Elisse Douglass","index":57},{"source":"gfm","image":"https://images.gofundme.com/PsdvLDXtfv3c94y0oPH2vkeL5q4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48447866_1590988829892986_r.jpeg","hearts":104,"launched":"2020-06-01T00:21:25-05:00","current":3878,"deactivated":false,"donations":104,"donations_enabled":true,"goal":10000,"name":"Restore & Rebuild Re’Luxe Black Owned Salon CHI","id":"restore-amp-rebuild-reluxe-black-owned-salon-chi","longDesc":"Greetings everyone. Given these extraordinary times, most if not all of us have experienced some kind of loss. Sadly, the business that my husband and I have worked so diligently to build was looted and destroyed in the wake of the Floyd protests. Re’Luxe Nail &amp; Spa Boutique is a Black-Owned establishment that we were proud to sink our time, effort, and money into to make it thrive. Then came Covid-19, which caused us to shut down for the safety of both our staff and loyal clients. Then came the protests, and on the eve of our re-opening Re’Luxe was looted and destroyed. We are truly at square one. As many of you may know, I am one who has devoted myself to giving back to the community. Only this time, we are the ones in need. I am asking for any help from the public to get our business back up and running. Any help would be appreciated. The protesters took EVERYTHING. I have nothing except for chairs to sit in, and tables to sit at. The money would be used to simply rebuild and re","desc":"Greetings everyone. Given these extraordinary times, most if not all o","region":"IL","shared_count":114,"campaign_state":"active","user":"Jasmine Clayton","index":58},{"source":"gfm","image":"https://images.gofundme.com/XdF1Jsx68hWG9r6n0J1lzD0nLew=/640x480/https://d2g8igdw686xgo.cloudfront.net/48432706_1590942060494570_r.jpeg","hearts":82,"launched":"2020-05-31T12:21:48-05:00","current":4515,"deactivated":false,"donations":82,"donations_enabled":true,"goal":20000,"name":"Downtown Raleigh Small Business Relief","id":"tz3c2-downtown-raleigh-small-business-relief","longDesc":"\nOur beloved downtown Raleigh took a beating last night and it seems that small businesses got hit the hardest even though they've already been suffering from the pandemic and are still trying to recover from it. Small businesses have kept our economy going and they continuously help make downtown the place we all love. It's time for us to pay them back and help them through the challenges and through recovering from what happened last night.\n\n\nWe're a group of NCSU students and recent grads that wanted to help small businesses in our community while also relaying the message of the protests and educating people as much as possible about racism in our country and what we all can do. We're organizing this GoFundMe to support small businesses that were affected yesterday. \n\n\nCommunity members: please donate as much as you can and share this link with everyone you know.\n\n\nDowntown small business owners: please fill out the following google form and we'll reach out to you once the funds st","desc":"\nOur beloved downtown Raleigh took a beating last night and it seems that small busin","region":"NC","shared_count":281,"campaign_state":"active","user":"Yusuf Ali","index":59},{"source":"gfm","image":"https://images.gofundme.com/7GKyBT_Zbc79wvy_gPqIiMSQ21I=/640x480/https://d2g8igdw686xgo.cloudfront.net/48437932_1590957847672945_r.jpeg","hearts":109,"launched":"2020-05-31T16:05:27-05:00","current":6293,"deactivated":false,"donations":109,"donations_enabled":true,"goal":5000,"name":"California Street Cannabis Destruction","id":"california-street-cannabis-destruction","longDesc":"\nOn Saturday, May 30th, our beloved California   Street Cannabis Dispensary was senselessly looted. As friends and family we are all devastated and heartbroken by the events that took place. \n\n\nIf you know Drakari ( CEO of California Street Cannabis Company), then you know the blood sweat and tears he has put into making this a successful business. Drakari has worked through so many obstacles to become a young, BLACK entrepreneur. We are so proud of what he has accomplished and know that with your support, he can continue being a leader in the community. \n\n\nWe know there are small businesses across the country being affected by everything going on, but if you are in Dra's network, know him personally, or just want to support a small business during these difficult times, we know he would appreciate it immensely. In the event that the insurance provider  is able to cover all costs, these funds will be donated to the Communities United Against Police Brutality Fund.\n\n\nLet's remember we n","desc":"\nOn Saturday, May 30th, our beloved California   Street Cannabis Dispensary w","region":"CA","shared_count":33,"campaign_state":"active","user":"Joshua Bustamante","index":60}],"regions":{"AL":{"byHearts":[35],"byLaunched":[35],"byRaised":[35],"byDonations":[35],"byGoal":[35],"byRemaining":[35],"byPercent":[35],"bySharedCount":[35]},"CA":{"byHearts":[14,60,12,34,53,2,23,28,19,57,56,6,18,7],"byLaunched":[34,57,2,18,6,19,28,60,23,14,7,53,12,56],"byRaised":[14,12,53,60,34,2,28,19,23,57,18,56,7,6],"byDonations":[14,60,12,34,53,2,23,28,19,57,56,6,18,7],"byGoal":[53,57,60,12,14,2,34,6,28,56,19,7,18,23],"byRemaining":[23,19,28,18,34,14,12,53,60,56,2,7,57,6],"byPercent":[23,14,12,28,19,34,18,53,56,7,60,2,6,57],"bySharedCount":[60,14,12,53,19,18,34,57,7,28,56,2,23,6]},"GA":{"byHearts":[38,8,45,39],"byLaunched":[39,38,45,8],"byRaised":[38,8,45,39],"byDonations":[38,8,45,39],"byGoal":[38,8,45,39],"byRemaining":[39,8,38,45],"byPercent":[38,8,39,45],"bySharedCount":[45,38,8,39]},"IL":{"byHearts":[58,17,54,48],"byLaunched":[48,58,17,54],"byRaised":[58,17,54,48],"byDonations":[58,17,54,48],"byGoal":[54,58,48,17],"byRemaining":[17,58,48,54],"byPercent":[17,58,48,54],"bySharedCount":[58,17,48,54]},"IN":{"byHearts":[26],"byLaunched":[26],"byRaised":[26],"byDonations":[26],"byGoal":[26],"byRemaining":[26],"byPercent":[26],"bySharedCount":[26]},"KY":{"byHearts":[9],"byLaunched":[9],"byRaised":[9],"byDonations":[9],"byGoal":[9],"byRemaining":[9],"byPercent":[9],"bySharedCount":[9]},"MN":{"byHearts":[33,30,31,29,11,49,22,50,21,20,10,42,41,0,27,43,1],"byLaunched":[1,29,22,41,10,20,21,49,30,0,31,42,43,11,33,27,50],"byRaised":[33,31,30,29,11,50,49,21,22,10,42,41,20,0,27,43,1],"byDonations":[33,30,31,29,11,49,22,50,21,20,10,42,41,0,27,43,1],"byGoal":[11,33,29,30,31,49,10,22,21,50,41,0,20,42,43,27,1],"byRemaining":[27,42,50,20,21,31,41,30,22,33,29,49,11,10,43,0,1],"byPercent":[50,31,42,30,33,21,20,27,29,22,41,49,43,10,0,11,1],"bySharedCount":[31,50,33,41,11,42,49,30,21,22,29,43,27,0,10,20,1]},"NC":{"byHearts":[59],"byLaunched":[59],"byRaised":[59],"byDonations":[59],"byGoal":[59],"byRemaining":[59],"byPercent":[59],"bySharedCount":[59]},"NE":{"byHearts":[44,15],"byLaunched":[44,15],"byRaised":[44,15],"byDonations":[44,15],"byGoal":[44,15],"byRemaining":[44,15],"byPercent":[44,15],"bySharedCount":[44,15]},"NY":{"byHearts":[16,36,55],"byLaunched":[16,36,55],"byRaised":[16,36,55],"byDonations":[16,36,55],"byGoal":[16,36,55],"byRemaining":[55,36,16],"byPercent":[55,36,16],"bySharedCount":[55,36,16]},"OH":{"byHearts":[37],"byLaunched":[37],"byRaised":[37],"byDonations":[37],"byGoal":[37],"byRemaining":[37],"byPercent":[37],"bySharedCount":[37]},"OK":{"byHearts":[32],"byLaunched":[32],"byRaised":[32],"byDonations":[32],"byGoal":[32],"byRemaining":[32],"byPercent":[32],"bySharedCount":[32]},"OR":{"byHearts":[3,4,5,24],"byLaunched":[5,24,3,4],"byRaised":[4,5,3,24],"byDonations":[3,4,5,24],"byGoal":[4,5,24,3],"byRemaining":[3,4,5,24],"byPercent":[3,4,5,24],"bySharedCount":[4,3,5,24]},"PA":{"byHearts":[13,51],"byLaunched":[13,51],"byRaised":[13,51],"byDonations":[13,51],"byGoal":[51,13],"byRemaining":[13,51],"byPercent":[13,51],"bySharedCount":[13,51]},"TX":{"byHearts":[52,46,40],"byLaunched":[40,46,52],"byRaised":[52,46,40],"byDonations":[52,46,40],"byGoal":[52,46,40],"byRemaining":[46,40,52],"byPercent":[46,40,52],"bySharedCount":[52,40,46]},"VA":{"byHearts":[25,47],"byLaunched":[47,25],"byRaised":[25,47],"byDonations":[25,47],"byGoal":[47,25],"byRemaining":[25,47],"byPercent":[25,47],"bySharedCount":[25,47]},"all":{"byHearts":[13,16,37,36,38,59,58,3,14,60,12,17,4,35,51,32,34,55,33,53,5,30,26,31,29,11,24,2,23,54,25,28,19,57,48,49,22,8,50,52,21,20,10,47,56,45,6,18,46,42,41,44,0,27,40,39,7,15,43,9,1],"byLaunched":[44,34,1,29,22,41,10,20,21,49,30,0,31,39,42,5,40,24,3,43,26,38,57,45,11,4,2,18,15,47,16,6,33,27,25,59,46,36,19,48,28,60,32,23,37,50,13,58,14,51,52,17,35,7,53,8,9,55,12,56,54],"byRaised":[13,14,16,37,12,51,4,58,36,17,38,59,53,55,5,60,3,32,35,33,26,31,54,24,34,30,29,11,48,8,25,50,49,2,28,47,45,19,21,52,23,22,57,10,42,46,41,20,18,56,40,7,44,6,39,0,15,27,43,9,1],"byDonations":[13,16,37,38,36,59,3,58,14,60,12,4,17,35,51,32,55,34,33,53,5,30,26,31,29,11,24,2,23,54,25,28,19,57,48,49,22,8,50,52,21,20,10,47,56,45,6,18,46,42,41,0,44,27,40,39,7,15,43,9,1],"byGoal":[54,16,4,5,24,35,36,53,57,60,3,11,12,14,26,32,37,38,58,2,33,29,30,31,34,48,51,52,55,59,8,49,13,45,47,10,6,22,25,21,50,28,41,46,56,19,0,7,18,20,40,42,39,44,15,17,43,23,27,9,1],"byRemaining":[23,9,17,27,42,50,19,28,20,13,25,44,18,21,39,51,59,55,46,31,41,34,14,30,37,12,22,15,8,58,38,33,29,3,48,32,4,36,16,53,26,5,60,49,56,35,47,11,24,45,10,40,54,2,7,43,52,0,57,6,1],"byPercent":[13,17,23,51,59,14,37,55,12,50,58,25,38,28,19,31,42,9,34,30,33,3,21,20,27,18,32,4,8,29,36,44,16,46,48,22,39,41,15,53,26,56,49,43,5,40,7,47,10,45,60,0,11,35,2,52,24,6,1,57,54],"bySharedCount":[13,60,51,14,4,58,12,17,31,50,45,53,19,59,38,33,55,3,36,5,41,11,16,18,32,42,8,49,35,30,39,34,57,25,7,21,28,22,37,56,47,29,52,26,24,2,43,48,23,27,9,40,46,0,44,10,6,20,54,15,1]}}}