{"campaigns":[{"source":"gfm","image":"https://images.gofundme.com/nK2K6LpRDqchKnCEq9nbcS3Twlg=/640x480/https://d2g8igdw686xgo.cloudfront.net/48397592_1590787150859815_r.jpeg","hearts":2765,"launched":"2020-05-29T16:50:41-05:00","current":124780,"deactivated":false,"donations":2766,"donations_enabled":true,"goal":100000,"name":"Rebuilding Bole Ethiopian Cuisine","id":"rebuilding-bole-ethiopian-cuisine","longDesc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  <br /><br />As we silently watched our beloved Bolé went up in flames, it was heartbreaking to witness, what we all considered our home, reduced to ashes. What is positive? It is witnessing the overwhelming messages and well wishes that Solomon, Rekik, and the Bolé staff have received.  And we thank you, on behalf of the entire family for standing with us when everything else seems like it has fallen beneath our feet. It is comforting to know that we are not alone in thinking that Bolé was not just a restaurant for us, Bolé was the pillar of the community. Bolé was our home away from home. Because your feedback to this unspeakable misfortune is to rise up, to rebuild, and to become the Bolé you all are accustomed to. And with your unyielding support, we are confident will have you dining at your clean tables in no time. <br /><br />As you might have also known, the irreplaceable damage was not only caused to Bolé restaurant. Bolé Express, the fast food version of the Bolé franchise, due to open on Sunday, May 31st, 2020 was also burned to the ground. Solomon and the entire crew spent the last 8 months building Bolé Express and they are incredibly proud of the vision to offer an alternative to our busy customers by grabbing their meals with a 2-minute turn around service. <br /><br />From the start, Bolé was a community driven business, this misfortune has taught all of us that community is what we all have when everything else is stripped away. Therefore, upon the overwhelming request by many of you, we have set up this platform so that you can donate for the initiation of the ‘Re-building Bolé’ project as you see fit. <br /><br />THANK YOU AND PLEASE CONTINUE TO KEEP THE BOLÉ FAMILY IN YOUR PRAYERS.<br /><br />- Family and Friends <br /><br /><br />Additional information: <br /><br /> <br />About the restaurant owners:<br /><br />Solomon and Rekik are active members of their community and they used Ethiopian food to connect people from all over the world.  They have two beautiful children.  While the situation has hit the family hard, they are not the type to lose hope.  <br /><br />About the organizers: <br /><br />The GoFundme account was created at the request of family members of Solomon and Rekik and community partners including Zehabesha (Henok Degfu), Dr. Sirak Hailu, and many other local supporters. <br /><br />My name is Lelna and I have had the privilege to work with Solomon and Rekik to strategize, build &amp; expand their business over the past 2 years in St. Paul, Minnesota. They are extremely hard-working individuals that are ready to get back to work. Bole as a whole was a family to many, including all the employees. In our best interests to support them during this difficult time, the community has come together to rebuild Bole. <br /><br />Our goal is to use the funds to build Bole - a restaurant that was a home away from home for many and a place of security and employment for the staff. The money raised will go directly to the Bole business owners via their business account where the owners will use it to start building a new business. In their own words - \"We want to build something that the community can be proud of and will call it their own.\"<br /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590787950669327_r.jpeg\" alt=\"48397592_1590787950669327_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590787886352741_r.jpeg\" alt=\"48397592_1590787886352741_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590787899747007_r.jpeg\" alt=\"48397592_1590787899747007_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590787931498809_r.jpeg\" alt=\"48397592_1590787931498809_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788282711898_r.jpeg\" alt=\"48397592_1590788282711898_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788300943404_r.jpeg\" alt=\"48397592_1590788300943404_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788998123297_r.jpeg\" alt=\"48397592_1590788998123297_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788320162302_r.jpeg\" alt=\"48397592_1590788320162302_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788333945621_r.jpeg\" alt=\"48397592_1590788333945621_r.jpeg\" width=\"100%\" media_type=\"3\" /><img src=\"https://d2g8igdw686xgo.cloudfront.net/48397592_1590788347318254_r.jpeg\" alt=\"48397592_1590788347318254_r.jpeg\" width=\"100%\" media_type=\"3\" />","desc":"George Floyd's life mattered! Our community is hurt and we are hurting with them.  As we","region":"MN","shared_count":5576,"campaign_state":"active","user":"Lelna Desta","index":0},{"source":"gfm","image":"https://images.gofundme.com/5xYNkCgetYuhMkHGY8sFRoXrK9o=/640x480/https://i.ytimg.com/vi/XkwvopGkAhg/0.jpg","hearts":261,"launched":"2020-05-29T14:00:57-05:00","current":11784,"deactivated":false,"donations":262,"donations_enabled":true,"goal":10000,"name":"Twin Cities Recovery Project: South MPLS support","id":"twin-cities-recovery-project-south-mpls-support","longDesc":"The Twin Cities Recovery Project is asking for donations to support our South MPLS community in the wake of the murder of George Floyd.  His murder showed the world the inequities we have been working to address in the Twin Cities. Our focus has been on recovery from substance use disorder, but our work has always been about addressing the grief and trauma experienced by our community. <br /><br />Our folks were already hit hard by the pandemic, and many of them are going to need support for the foreseeable future. There are no stores open due to the unrest in the area, and most of the people we serve were already living in food deserts. With our current staff, we believe that we can successfully connect those most at-risk for food insecurity, side-effects of MH issues and trauma, and those at risk for overdose with the services they need.  <br /><br />We have already started with direct support: food, diapers and formula, and continued naloxone distribution, and will transition to scaling up our grief and trauma services as we are able. We need funding to help address the immediate needs of a suffering and traumatized community. <br /><br />We have a $1,000 match from a generous donor to get us kicked off. <br /><br />Please consider supporting us.","desc":"The Twin Cities Recovery Project is asking for donations to support our","region":"MN","shared_count":429,"campaign_state":"active","user":"Jordan Hansen","index":1},{"source":"gfm","image":"https://images.gofundme.com/0fD-4yhQev-Nuz9fQnODpo30EfE=/640x480/https://d2g8igdw686xgo.cloudfront.net/48345040_1590602439903874_r.jpeg","hearts":288537,"launched":"2020-05-27T13:28:33-05:00","current":7454100,"deactivated":false,"donations":292254,"donations_enabled":true,"goal":1500000,"name":"Official George Floyd Memorial Fund","id":"georgefloyd","longDesc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear brother, George. <br /><br />My family and I watched in absolute horror as the now infamous and horrifying video began to spread quickly throughout social media. What we saw on that tape left us shell shocked; a white Minneapolis police officer kneeling directly on my brother's neck, obstructing his ability to breathe. As some officers knelt on his neck, other officers participated and watched; no one took any action to save my brother's life.  Those officers would continue to brutalize my brother until he died. This fund is established to cover funeral and burial expenses, mental and grief counseling, lodging and travel for all court proceedings, and to assist our family in the days to come as we continue to seek justice for George.  A portion of these funds will also go to the Estate of George Floyd for the benefit and care of his children and their educational fund.<br /> <br />Anyone wishing to send cards, letters of encouragement  and/or contributions in the form of a money order or check, may do so by mail at:<br /> <br />The Estate of George Floyd<br />c/o Ben Crump Law, PLLC<br />122 S. Calhoun Street<br />Tallahassee, FL 32301<br />Attn: Adner Marcelin<br /> <br />All checks must be made out to: The Estate of George Floyd<br />  <br />Commonly asked questions:<br /> <br />1. Who you are: Philonise Floyd, brother of George Floyd<br /> <br />2. Where you’re from? Houston, TX<br /> <br />3. Your relationship to the parties you’re raising funds for? George was my biological brother. <br /> <br />4. How the funds will be spent? Funds collected here will be spent by the Floyd family as outlined above. This fund will be governed and controlled at the discretion Philonise Floyd for the family's benefit.<br /> <br />5. How do you intend to get the funds to those in need? All funds collected on this website will be withdrawn to an established account for the benefit of my family. 100% of funds collected here will go to my family. <br /><br />6. Are there any other legitimate funds? Yes, <a href=\"https://www.gofundme.com/f/george-floyd-bigfloyd\" target=\"_blank\" class=\"\" rel=\"nofollow noopener noreferrer\">https://www.gofundme.com/f/george-floyd-bigfloyd</a> is also a legitimate fund. <br /><br />Anyone with further questions about this page may contact Adner Marcelin of Ben Crump Law, PLLC at (850) 224-2020 or adner@bencrump.com.<br /><br />From the bottom of our hearts my family thanks each of you who have reached out. While we are not able to respond to each expression of love at this time,  please know that we love and appreciate each and every one of you. Our hearts are overwhelmed!<br /><br />- Philonise<br /><br /><br />Disclaimer: Fund set up and managed by Adner Marcelin","desc":"On May 25, 2020, my life shattered as I learned of the tragic passing of my dear b","region":"MN","shared_count":204204,"campaign_state":"active","user":"Philonise Floyd","index":2},{"source":"gfm","image":"https://images.gofundme.com/YzQh1XepzFdf9pX6yjv3U8x_Ns4=/640x480/https://d2g8igdw686xgo.cloudfront.net/48424366_1590898497504932_r.jpeg","hearts":402,"launched":"2020-05-30T23:17:02-05:00","current":21743,"deactivated":false,"donations":402,"donations_enabled":true,"goal":15000,"name":"Restore JapanLA","id":"restore-japanla","longDesc":"<strong><a href=\"http://japanla.com\" target=\"_blank\" rel=\"noreferrer noopener\">JapanLA</a></strong>  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide that live and breathe cute culture. <br /><br /><br />During the evening of May 30th, JapanLA was LOOTED and VANDALIZED by rioters following the protest march throughout Los Angeles. Our hearts, like many of you, are broken seeing the footage that was broadcast on television. <br /><br /><br />Through this GoFundMe, we hope to help our friend Jamie to rebuild this storefront to once again shine on Melrose Ave. JapanLA holds a special place in our hearts and the hearts of many others around the world. Now is the time for us to come together and help JapanLA rebuild their beautiful store that they have worked so hard to make a safe and fun space for us all. <br /><br /><br />These donations will help cover the major cosmetic damages and loss of merchandise in addition to help from the effects of COVID-19. <br /><br /><br />Let's show up for them the way they have for us for over 10 years. If you have the means to make a donation, anything helps. If not, we encourage you to support them by sharing this page or by sharing a moment you've had with <a href=\"http://instagram.com/JapanLA\" target=\"_blank\" rel=\"noreferrer noopener\">JapanLA</a>   that's brought you joy.<br /><br /><br />Love,<br /><br />Chrissa Sparkles and Jon (KawaiiGuy)","desc":"JapanLA  is a staple to Los Angeles that celebrates unity, inclusivity and people of all colors worldwide t","region":"CA","shared_count":2878,"campaign_state":"active","user":"Jon Brence","index":3}],"regions":{"CA":{"byHearts":[3],"byLaunched":[3],"byRaised":[3],"byDonations":[3],"byGoal":[3],"byRemaining":[3],"bySharedCount":[3]},"MN":{"byHearts":[1,0,2],"byLaunched":[2,1,0],"byRaised":[1,0,2],"byDonations":[1,0,2],"byGoal":[1,0,2],"byRemaining":[0,1,2],"bySharedCount":[1,0,2]}},"all":{"byHearts":[1,3,0,2],"byLaunched":[2,1,0,3],"byRaised":[1,3,0,2],"byDonations":[1,3,0,2],"byGoal":[1,3,0,2],"byRemaining":[0,1,2,3],"bySharedCount":[1,3,0,2]}}